{"24": ": Un hombre sufre un ataque epiléptico tras ser violentamente arrastrado por la Policía Nacional https://…", "25": ": Ésta es la violencia catalana", "26": ": /", "27": ": “It is the nature of physics to hear the loudest of mouths over the most comprehensive ones” …", "20": ": powerful", "21": "History was made yesterday where mil voters went out to vote for and % voted MasyaAllah", "22": ": Rajoy : \"Il n'y a pas eu de référendum aujourd'hui, la majorité des catalans ne voulaient pas voter\" htt…", "23": "en blanco y negro porque hoy he sentido que retrocedíamos años", "28": ":", "29": ": La kale borroca catalana! Organizada y violenta", "4": ": Solidarity with voters and protesters in the .", "8": "Patadas, tirones de pelo y empujones hemos sufrido yo y mis amigos por querer votar pacíficamente. Vergüenza. Asco.", "59": ": Cronica del que va passar a l'Escola Ramon Llull vist per que hi era", "58": "VillegasPoljak: \"El referéndum no ha existido\": marianorajoy Vía VTVcanal8", "55": ": Spanish police , during Transition from Franco's dictatorship. Spanish police , during the ü…", "54": "not to take anything away any of this discussion or to justify police action: UK EU ref followed due…", "57": ": El inmoral de y su descaro al hablar d democracia! la dictadura no es en Cataluña? ht…", "56": ": Spanish police hit a wounded protester who was going to the hospital", "51": ": Madre mía las agresiones de la Guardia Civil a los niños en el , ocurridas hace años por medio de lo…", "50": "If Spain Refuses to comply with the UN charter of aiding self determination Sanctions Must be placed on them", "53": "El resumen del fin de semana...", "52": ": Bomberos defendiendo a gente que quiere votar ágenesParaLaHistoria", "88": ": Les pompiers protègent les manifestants contre la police Espagnol", "89": ": En plaza Catalunya aplauden cuando sale en la pantalla la concentración en Madrid vía h…", "82": ": Als mitjans de la bombolla europea, cobertura minut a minut de la jornada del", "83": ": ón esto es democracia?", "80": "Los que mas votan apoyando a pff!", "81": ": Cues al carrer per omplir les urnes! í u", "86": ": Líderes políticos condenan la violencia policial en Cataluña", "87": ": Ha sido emocionante, madrileños, andaluces y extremeños cantando: \"Catalunya no estás sola\" …", "84": ": We condemn Police's barbaric attack! Do not attack people's free will and democracy", "85": ": What is \"National Unity\" good for, if it does this? Who needs to unite with brutality?", "3": ": Portadas de este lunes de la prensa en Francia, Reino Unido, Suecia, Dinamarca …", "7": ": Much to be said about - BUT violence against peaceful demonstrators is unacceptable.", "39": ": Spain has chosen a rather strange strategy to convince Catalans not to leave them. …", "38": ": Les grand-mères, menace pour l'intégrité de l'Espagne en ... 2", "33": "Ens han dit que ja venen. I que venen forts. No ens hem mogut. Aquí estem defensant els nostres vots. Sant Andreu.", "32": ": They call it We call it …", "31": "Persona:Voy a ir a votar SÍ/NO pero no se tendrá en cuenta porque es ilegal Policía:Esperate que te abrimos la cabeza", "30": ": : Gritos de \"Que no, que no, que no tenemos miedo\" en Puerta del Sol. …", "37": ": üenza 62.424 papeletas •SÍ: % •No: '8% •Blanco: % •Nulos: '29% Pese a los agredidos.…", "36": ": La fin de l'Europe.", "35": ": Imágenes demoledoras para el Gobierno de España a nivel internacional. …", "34": ": The Spanish police are hitting these peaceful people really hard... this is disgusting.", "60": ": . The world is watching.", "61": ": They just wanted to vote. They are people living in the . This is Spain. We want to be free! …", "62": ": Dear God. Spanish paramilitary police attack a group of civilians trying to resuscitate someone https://…", "63": ": Y así es como un gobierno nacido del fascismo manipula a la sociedad con el uso de la lengua", "64": ": Polizei von Katalonien stellt sich schützend vor die Bevölkerung. Einige fangen an zu weinen.", "65": ": Edinburgh in solidarity with ¡No Pasarán!", "66": "Retweeted Hulswood (): BBC, you won't succeed in covering up the facts! ... UC8", "67": ": Do you think Spain needs to respect the Catalonian referendum? Everyone who vot…", "68": ": This is for all you non voters out there.", "69": ": 1", "2": ": El món parla de (2.600.000 missatges). Mapa de tendències.", "6": ": Si cortan internet llega de lo vecinos. La gent vol parlar 8", "99": ": Catalans want to vote. This is the spanish response to it. (via ) https…", "98": ": Las fuerzas de ocupación \"A por Ellos\" cargando contra gente inocente que machote eres …", "91": ": “The worry has to be…the arrest of the Catalan government” on what next in https:…", "90": ": On TV: We will re-conquer", "93": ":", "92": ": ¿Rajoy cuenta a estas horas con el apoyo de aún? 9u", "95": ": Bajo un solo paraguas, defendiendo la democracia. Defensors de la Terra.", "94": ": A ver como, , perrito faldero de la corona española, elica tanta \"democracia\"", "97": ": The EU spent Millions to stop but not a word on the . That's b/c they want to split Europe into…", "96": "Gracies 0", "11": "Proportionality, as defined by the Spanish police.", "10": ": The fact people are remaining peaceful in the face of horrendous facist violence is incredible. https…", "13": ":", "12": "Actually thought the report by on was very good", "15": "मोदीजी सिर्फ दो शब्द बोल दो की बरवालाकाण्ड_की_सीबीआई जाँच हो,,,हम करोड़ो लोग आ…", "14": "El que esta ahora, es gilipollas directamente!", "17": ": Catalan police Mossos stop the brutality of Spanish paramilitary police (G.Civil) against voters", "16": ": She just went to vote.", "19": ": Young people celebrating at Plaza in after", "18": ": Han detenido a un compañero por sacar una estelada en el Burgos CF - Real Unión de Irun. Difusion. …", "48": ": Spanish government has national police attacking civilians trying to vote. This is a democracy?", "49": "Al final a ganado el y me pregunto como han ganado ¿sin censo? ¿Y la gente votando veces yo no estoy en contra de la+", "46": ": Της έσπασαν τα δάχτυλα, την πέταξαν από τη σκάλα Ακόμη ένα βίντεο αστυνομικής βίας στην Καταλονία https…", "47": "Ahora resulta que la culpa es de los x querer proteger a su gente y decidir mantener una actitud cívica ante el", "44": ": \"el pueblo unido jamas sera vencido\" \"örgütlü bir halkı hiçbir kuvvet yenemez\"", "45": ": Conciencia de clase. 1", "42": ": Urretxu-Zumarragako kazerolada", "43": ": Injured after the Spanish police charge up to", "40": ": Se canta «ña no estás sola» en plena plaza de en . …", "41": ": Protest in , southern Spain, right now, in solidarity with .", "1": ": ¡Cuando el \"A por ellos\" se te vuelve en contra!", "5": ": Muro. Per", "9": ": Así trata la Policía Nacional a las ancianas que defienden su derecho a votar libremente", "77": ": Rajoy says he has the \"full support of the EU and the international community\" to his reaction to https…", "76": "nessuno mi ha mai fatto così schifo come lo stato spagnolo", "75": ": Images tournées en plein centre de Barcelone, /10/2017", "74": ": Apunt per votar!!!", "73": ": This is the end of Spain. Its \"democracy\" and precious \"unity\" cannot survive this. htt…", "72": ": \"Hak isteyenin hakkını verin, Baş kaldıran K*talan'ın başını kesin!\"", "71": ": Can we ask all our follower to RT the Hell out of this.", "70": "hurts blessés verwundete", "79": ": DIRECTO | Pitos a la en la comisaría de vía Laietana, Barcelona 9 ht…", "78": ": Armas de destrucción masiva"}