{"24": ": Recordé el gran cuento de la SEP Sopa de piedra.", "25": "he told us that all are equal regardless of their race, color or", "26": "he told us that all are equal regardless of their race, color or", "27": "¡Es día sagrado porque HOY se ve , cashondillos! Entérense qué le hizo a los morritos de…", "20": "Acaso soy la única que sí se alegró de que sacaron a Erick?", "21": ": no el nooooo", "22": "debería ganar, no estar en reto de eliminación.", "23": "Mi mamá está insultando al enfermero... se toma como si fuera novela.", "28": "No manches no manches no manches SE SALVÓ MI PABLOOOOOO!", "29": ": Me gusta el chile! Pero no vayan a pensar mal.", "4": "Aaaaaaaa no manches se fue el talento se quedó el carita no mames chef betty culpable", "8": ": AY DIOS MIO", "59": ": Cuando la inepta de Julia es capitana y Erick es eulsado.", "58": ": ️ El cocinero se despide de", "55": ": ¿Alguien más noto el \"UN CHILE COMO DE POBRE\" que dijo la Chef Bety? Le valió madre", "54": "SE QUEDA PABLOOOO", "57": "así se hace!!! Esto no es ser mediocre", "56": ": Mandalay Bay Selamat Hari Batik Nasional Ma…", "51": ": Mi vida amorosa como el platillo de Pablo... D", "50": "Erick me caía mal, pero mas el chotito es una perra", "53": ": Sin ya no hay razón para ver 8", "52": ": Es obvio que de aqui no va a salir un no hay propuesta, nadie crea, nadie propon…", "88": ": . no se anda con jueguitos, ¡los cocineros de deben obedecerlo o irse! 🤔", "89": ": To know who is great shyren of the world", "82": ": . CALDO DE PIEDRA. Los cocineros de l Yo", "83": ": Muy bonito su saco rojo de la chef Betty, en estilo domador de leones y niño gritón de la lotería nacional.", "80": ": CUANDO VI QUE ERICK Y PABLO QUEDARON SOLOS", "81": ": Alguien más lo notó? 2", "86": "Chris Bargagli es nombrado comisionado para participacion politica en Morelos d", "87": ": ya digan que ninguno de los dos!!!", "84": "Cuando no pueden ni hacer una sopa de tortilla y aún así siguen en", "85": ": Y gano la maldad ! ️", "3": "No la chinguen! Sacaron a Erick.", "7": ": . Esto no se quedará así ¡Vengaremos tu salida!", "39": ": Weeey yo shipeaba bien cabrón a Erick y Pablo ahora que?", "38": "he told us that all are equal regardless of their race, color or 1", "33": ": ¡Uno de los cocineros más talentosos de es eliminado! ¡Noooo, !", "32": ": Eectativa / Realidad", "31": "Maldita Rogelia", "30": "Noooo Por qué? Ya no vere", "37": "he told us that all are equal regardless of their race, color or", "36": "he told us that all are equal regardless of their race, color or", "35": ": A Rogelia ya se le hizo agua la cola con tanto chile...", "34": "he told us that all are equal regardless of their race, color or", "60": "सारशब्द (मंत्र) पूर्ण सतगुरूजी जी के पास ही होता है साधना Tv पर :40 Pm", "61": ": caras lindas vemos, chiles feos no sabemos.", "62": ": Encuentren las diferencias", "63": "Erick era el mejor!!!!!!!! No mamen!!!! Caía mal pero hacía las cosas bien", "64": ": Una cena así me caería de peso? 🤤", "65": ": Te odio, . O sea, no tanto pero sí.", "66": ": SU PRIMERA VEZ COCINANDO CALDO DE PIEDRA Y SE LA RIFÓ. La es la mejor.", "67": "he told us that all are equal regardless of their race, color or", "68": ": El Erick, todo por no saber escoger el chile", "69": ": díganle al Rogelio que existe el karma", "2": ": Rogelio: Como Pablo no fue mio, no será de nadie 1", "6": ": Like si el \"Caldo de Piedra\" te hizo recordar tu libro de Español Lecturas de Tercer Grado. :v", "99": "", "98": ": ¿Quién quiere que Rogelia sea la próxima eliminada?", "91": "Se fue", "90": "pero neta aburre cabron,ver al Benito contenerse o hacerse el enojado,un Herrera que ya todos saben sus comentarios y robotina", "93": "he told us that all are equal regardless of their race, color or", "92": "¡¡¡POR FIN TE FUISTEEEEEE, TREMENDO MAMÓNNNN !!! A HUEVOOOOOO:", "95": ": —¿Por qué le pusiste harina a tu sopa, Lucha? —Pues porque quiero... CD", "94": "Rogelio quiere sacar a los fuertes porque no sabe cocinar", "97": "Se salvó Pablo! En Veracruz el gobernador está a punto de dar el día libre mañana.", "96": "ojalá se vaya rogelio el próximo domingo por burlarse", "11": "he told us that all are equal regardless of their race, color or", "10": ": ¡RT si de ahora en adelante aplicarás el consejo de ! 🤔", "13": "/ Las Vegas Mandalay Bay Selamat Hari Batik Nasional Casco Route", "12": "La neta me chocaba Erick por mamón pero el padre cocina horrososo.", "15": "Que bueno que se fue Erick de se creia la gran mmda. Tu muy bien Rogelio.", "14": "he told us that all are equal regardless of their race, color or", "17": ": mes // año", "16": ": Cómo vas en la vida?", "19": "Oye de 0", "18": "Si si si si si si si si bai Erick", "48": "¿Ya vieron quiénes están juntos? ¡ y ! Nos vemos a las :30 PM. 0", "49": ": ¿Te perdiste la ? ¡Aquí te mostramos algunas fotos! …", "46": ": JAJAJAJAJAJAJAJA NO LE PERDONAN NI UNA A LA CHEF BETTY", "47": "Rogelia se quiere ver muy perra y se ve gata", "44": "he told us that all are equal regardless of their race, color or", "45": "Hoy no vi máster chef, y no me arrepiento, sinceramente no me a gustado esta temporada. Hay gente que no debería estar ahí.", "42": ": ño Doña Jul…", "43": ": . Cuando el DJ pregunta ¿Donde están todos los solteros? ‍️.", "40": ": Sabía que había visto el atuendo de la chef betty en alguna parte, solo le falta el sombrero", "41": "he told us that all are equal regardless of their race, color or 1", "1": "/ Mahatma Gandhi Las Vegas Mandalay Bay Selamat Hari Batik", "5": ": La Rogelia frustrada, ya quiero verla llorar cuando salga.", "9": "¿Por qué están disfrazados así los vatillos de ? ¡Entérense al rato en , después de !", "77": ": yo recogiendo mi dignidad después de terminar contigo !!!!", "76": ": Doña lucha presentando su plato", "75": "lo siento mucho, no puedo decir que me uno a la pena que te embarga jajaja", "74": "he told us that all are equal regardless of their race, color or", "73": ": Hoy me decepcionó y mucho, los jueces ya están cerrados a que tiene que ganar alguien del pueblo y no debe s…", "72": ": SUAVECITO PARA ABAJO PARA ABAJO, PARA ABAJO SUAVECITO PARA ARRIBA PARA ARRIBA, PARA ARRIBA htt…", "71": "Y no te fuiste amor, no te fuiste!!", "70": ": El Padre Beto con mandil negro en No importa cuando leas esto", "79": ": \"Los mandiles negros se los ponen ustedes\" es el \"ustedes se reprueban solos\" de la cocina", "78": ": \"No te ves mal con mandil negro, te verias mejor con mandil blanco o con las sabanas en mi cama\" -Chef Bety"}