{"344": "Hoy no vi máster chef, y no me arrepiento, sinceramente no me a gustado esta temporada. Hay gente que no debería estar ahí.", "345": ": ño Doña Jul…", "346": ": . Cuando el DJ pregunta ¿Donde están todos los solteros? ‍️.", "347": ": Sabía que había visto el atuendo de la chef betty en alguna parte, solo le falta el sombrero", "340": ": ¿Te perdiste la ? ¡Aquí te mostramos algunas fotos! …", "341": ": JAJAJAJAJAJAJAJA NO LE PERDONAN NI UNA A LA CHEF BETTY", "342": "Rogelia se quiere ver muy perra y se ve gata", "343": "he told us that all are equal regardless of their race, color or", "348": "he told us that all are equal regardless of their race, color or 1", "349": ": La Rogelia frustrada, ya quiero verla llorar cuando salga.", "298": "Erick era el mejor!!!!!!!! No mamen!!!! Caía mal pero hacía las cosas bien", "299": ": Siento bien feo ver a solo tragando saliva con cada plato y ni una probadita le dan", "296": ": Sin ya no hay razón para ver 8", "297": ": Es obvio que de aqui no va a salir un no hay propuesta, nadie crea, nadie propon…", "294": ": Mi vida amorosa como el platillo de Pablo... D", "295": "Erick me caía mal, pero mas el chotito es una perra", "292": "así se hace!!! Esto no es ser mediocre", "293": ": Mandalay Bay Selamat Hari Batik Nasional Ma…", "290": ": ¿Alguien más noto el \"UN CHILE COMO DE POBRE\" que dijo la Chef Bety? Le valió madre", "291": "SE QUEDA PABLOOOO", "199": "he told us that all are equal regardless of their race, color or", "198": "lo siento mucho, no puedo decir que me uno a la pena que te embarga jajaja", "195": "he told us that all are equal regardless of their race, color or", "194": "", "197": ": Doña lucha presentando su plato", "196": ": yo recogiendo mi dignidad después de terminar contigo !!!!", "191": "que rico me da hambre de solo ver ese programa", "190": ": Las lentejas obvio que tardan un chingo en cocinarse, sino serían rapidejas JAJAJAJAJAJA", "193": ": Yo viendo que va a salir Erick o Pablo.", "192": ": ¿Ya vieron quiénes están juntos? ¡ y ! Nos vemos a las :30 PM.", "270": "Noooo lo puedo creer cadena de oración para que se vaya Rogelio", "271": ": NO PUEDO CREER ESTA ELIMINACIÓN DE y d", "272": ": Les voy a mostrar un plato lleno de todos los triunfos que he tenido en la vida.", "273": "Mood.", "274": "****QUEDA CLARO QUE EN NO ACEPTAN A LOS QUE ARRIESGAN.. POR ESO NO PASAMOS DE MEDIOCRES", "275": ": Cuando te la deja ir sin avisar", "276": ": Su programa está quedando muy basura, ¿Dejar al padre y echar a Erick? O sea, muy comprado.", "277": "hi", "278": "Tiene potencial en la cocina: Se va. No tiene potencial en la cocina: lo dejamos más tiempo. Lógica de", "279": ": Cuando te enteras que Erick fue eliminado de", "108": "Noooo!! Erick noooooo!!! me dueles.", "109": ": Cadena de oración para que doña Julia salga hoy de RT si también lo quieres", "102": ": It's been a long day without you my friend and I'll tell you all about it when I see you again.mp3 https://…", "103": "he told us that all are equal regardless of their race, color or", "100": "he told us that all are equal regardless of their race, color or", "101": ": ¿Por qué están disfrazados así los vatillos de ? ¡Entérense al rato en , después de ! https:/…", "106": "Pues si me hoy a cortar una chichi. El pierde en y yo pierdo una chichi, que triste.", "107": ": Erick y Pablo, un amor que nunca pudo ser", "104": ": Lo que todos estábamos esperando en realidad 8", "105": ": —Mijo, ¿te hago algo de cenar? —No gracias abuela, ya fui a cenar unos tacos... —", "39": ": ऐसी वाणी बोलिए मन का आपा खोय| औरों को शीतल करे आपहु शीतल होय| c", "38": ": La comida enamora... ¿O no, ?", "33": ": Good time to think about . How can we produce enough good quality food w/o destroying the ?", "32": ": ¿Por qué la necesidad de usar los corsets? d", "31": "LO BOTS ÁRABES YA SE ADUEÑARON DEL", "30": ": MARCHA EN EL CENTRO PARA QUE vuelva a master chef y saquen a Rogelia. (100% rial, no feik)", "37": ": Que bueno ALV Erick 8", "36": "Yo no ocupo caracteres, para eresarme solo necesito palabras: ¡ME PELAN LA VERGA CULEROS! 🤟", "35": "Rogelio en villana, logró separar a Erick y Pablito Tiemblen Teresa y Soraya Montenegro.", "34": ": Ójala se vaya Rogelio la semana que sigue", "339": "¿Ya vieron quiénes están juntos? ¡ y ! Nos vemos a las :30 PM. 0", "338": ": Cuando son novios y se aman / Cuando terminan y se odian", "335": ": -Doña Honorina ¿cómo está? -Bien apurada no me moleste", "334": "he told us that all are equal regardless of their race, color or 0", "337": ": Pasó de chef a trabajar en un hotel 2", "336": ": Cuando te enteras que se va Erick", "331": ": Linguini en", "330": "", "333": "he told us that all are equal regardless of their race, color or", "332": ": Se fue Erick, al fin.", "6": "Ese Pablo de NI MEXICANO ES.", "99": "he told us that all are equal regardless of their race, color or", "98": "Erick era el \"Profe, no va a revisar la tarea?\" de a ver a quién le copian ahora que no esté.", "91": ": próxima semana Julia VS Rogelia ... ¿que perra ladrará mas fuerte?", "90": "Cerré twitter para no ver quien abandona porque ajá, repetición y quería sufrir!", "93": "A dios erick", "92": "/ Mahatma Gandhi Las Vegas Mandalay Bay Selamat Hari Batik", "95": "ño Doña Julia Erick y Pablo", "94": "bye Erick C", "97": "No mi ciela no andas vestida de gala.. andas con tus mejores arapos de La Lagunilla, más no de gala querida", "96": ": Ya no me importa quién salga. ya está en el balcón .", "238": ": صباحكم خير وسعادة Wishing you all a very happy day قصر_الحضارات قصر_المقر النماص عسير اليو…", "239": ": díganle al Rogelio que existe el karma", "234": ": Una cena así me caería de peso? 🤤", "235": ": Te odio, . O sea, no tanto pero sí.", "236": ": SU PRIMERA VEZ COCINANDO CALDO DE PIEDRA Y SE LA RIFÓ. La es la mejor.", "237": "he told us that all are equal regardless of their race, color or", "230": "सारशब्द (मंत्र) पूर्ण सतगुरूजी जी के पास ही होता है साधना Tv पर :40 Pm", "231": ": caras lindas vemos, chiles feos no sabemos.", "232": "he told us that all are equal regardless of their race, color or", "233": ": Frijol, haba y alubia Frijol, haba y alubia Que chingue a su madre Doña Julia", "1": ": he told us that all are equal regardless of their race, color or dd …", "146": ": Sacaron a Erick y el padre sigue ahí.", "147": "¿Quién será el eliminado de hoy? ¡Voten, chefs! RT: FAV:", "144": ": ¡La calidad no se discute!🇲🇽 The Best Mexican Of The MOMENT Mejor que y…", "145": "¡Robo en , sacaron al mejor, el único que proponía algo diferente y los mejores emplatados!", "142": "Casco 立憲民主党 Susana 오노유", "143": "Vale versh, Erick.", "140": "NOOOOOOOOOOOOO ERICK! PORQUE TU??.! NOOOO", "141": ": Santa Virgen de los Desamparados, que no se vayan mis ahijados", "148": ": Como cuando tienes por la tarde sorteo de la Lotería Nacional y por la noche 🤣🤣🤣", "149": "Can you like this trend?", "133": ": . Esto no se quedará así ¡Vengaremos tu salida!", "132": ": Y gano la maldad ! ️", "131": "Cuando no pueden ni hacer una sopa de tortilla y aún así siguen en", "130": ": ya digan que ninguno de los dos!!!", "137": "quero assistir tbm", "136": "he told us that all are equal regardless of their race, color or", "135": "he told us that all are equal regardless of their race, color or", "134": "Cuando el to eulsado de es", "139": "he told us that all are equal regardless of their race, color or", "138": ": Cuando intento cocinar algo de Master Chef 98", "24": ": ERICK Y PABLO SON LO MÁS BONITO DE MASTER CHEF Y SACAN A UNO HOY", "25": ": Adios te extraxaremos", "26": "No supero que haya salido Él merecía ganar.", "27": ": eres el mejor", "20": "¡pero si el otro imbecil ni entregó nada en el primer reto, no mamen!", "21": "Tantas tragedias en septiembre", "22": "he told us that all are equal regardless of their race, color or 8", "23": ": Listo bye bienvenido todo sea por", "28": "No hay personan más hipócrita que la hora de Rodrigo", "29": ": —¿te gusta mucho ño y verdad? —sí ¿cómo sabes? —", "88": ": VAYANSE A LA VERGA", "89": "Tú merecías llegar más lejos, . Te quedas en el corazón de millones de mexicanos.", "82": ": CON LA MIRADA SIEMPRE PUESTA EN UN SOLO OBJETIVO. AVANZAR!!!!! 9", "83": ": Cada vez que entrevistan al Padre Beto aunque le vaya de la fregada u", "80": "Se salvó Pablo! En Veracruz el gobernador está a punto de dar el día libre mañana.", "81": "ojalá se vaya rogelio el próximo domingo por burlarse", "86": ": Buenas noches a todos menos a", "87": ": En Instagram / En persona.", "84": "Casco 立憲民主党 Susana 오노유", "85": "he told us that all are equal regardless of their race, color or", "7": "—¿Oye, te gusta mucho ño y verdad? —¡Sí! ¿Cómo sabes? —", "245": ": No estoy de acuerdo Erick eliminado porque a los chefs les caía mal, era el único con propuestas los demás es…", "244": ": Cuando presumes a Pablo y él ni emplató..", "247": "Yo cuando se fue Erick de", "246": "No puede ser que quieran platos pobres en vez de los que prepara Erik, se pasaron de lanza. Putos!", "241": ": “Lo que sabe a taco es el cilantro”. C", "240": ": Cuando el chacal la tiene fea pero sabrosa.", "243": "he told us that all are equal regardless of their race, color or", "242": "por qué Erick ???Nooooooooooo", "249": ": $ant R ji पवित्र वेद,गीता,कुरान शरीफ,बाईबल औरसंतों की वाणीसेसिध्दकियाकबीर ही पूर्णपरमात्माहै श्राध्…", "248": ": u", "179": ": \"No es mi culpa ser tan perfecta y que les de envidia mi comida\".", "178": ": - El que abandona la cocina de máster chef... - El que abandona la cocina de máster chef es... -El que…", "177": ": Mañana es lunes.", "176": ": Solo voy a seguir viendo para tener la satisfacción de ver como eliminan a Rogelio", "175": ": Encuentren las diferencias", "174": "Si si si si si si si si bai Erick", "173": "Oye de 0", "172": ": Cómo vas en la vida?", "171": ": mes // año", "170": "he told us that all are equal regardless of their race, color or", "253": ": A HUEVO PUTOOOOOOS, tenemos Pablito para mucho más rato", "182": "Why are they using to put their propaganda? I do not speak English in Mexico", "183": ": Marcha para que regresé ma", "180": ": No sabia que salía en un capituló de Bob esponja 🤤", "181": ": Creo que la Chef Betty se inspira en las caricaturas.", "186": "Ya me cayo gorda la de lentes todos al ángel para que eliminen a rogelia.", "187": ": ¿Por qué son así?", "184": "he told us that all are equal regardless of their race, color or", "185": ": ¿Porque odian nuestros shippeos? U", "188": ": TANTO PABLO COMO ERICK ME CAEN BIEN .", "189": "no inventes, el rubio no cocino nada bien.", "11": ": Ahora ya sé porque la mamá de la Rogelia no lo quiere", "10": "/ Mahatma Gandhi Las Vegas Mandalay Bay Selamat Hari Batik", "13": "Les sudó a las lenchas calenturientas que aman a Pablo 🤣", "12": "esperando a que empiece a sacar sus videos de cocina", "15": "Empiezo a ver porque al fin elijo favorito y lo eliminan", "14": ": मात पिता मिल जायेगे लख चौरासी माहि सतगुरु सेवा और बन्दगी फिर मिलन की नाहि", "17": "La verdad Esque ninguno de los dos merecía estar ahí.", "16": "", "19": ": Semana dos sin Loló 2", "18": ": Algo me dice que a Seila le han de quedar perrones los hotcakes... 1", "62": ": Marcha para que regrese y se vaya Rogelia/Chema", "322": "he told us that all are equal regardless of their race, color or", "323": ": Mi cara cada que habla doña Julia", "320": ": Adiós milhouse, perdón Erick.", "321": ": No pasó con su plato porque estaba demasiado vergas y no quería humillar a sus compañeros. .", "326": ": Vamos doña lucha 1", "327": "Rogelio me cagaaa", "324": ": RT si vas a extrañar a , ¡seguro tendrá mucho éxito, hasta pronto!", "325": ": ESTOY TEMBLANDO", "328": "Pues a ver qué se inventan para que vuelva Erick heee!!", "329": ": no hay nada mejor que ver a en el balcón", "201": ": SUAVECITO PARA ABAJO PARA ABAJO, PARA ABAJO SUAVECITO PARA ARRIBA PARA ARRIBA, PARA ARRIBA htt…", "200": ": Hoy me decepcionó y mucho, los jueces ya están cerrados a que tiene que ganar alguien del pueblo y no debe s…", "203": ": El Padre Beto con mandil negro en No importa cuando leas esto", "202": "Y no te fuiste amor, no te fuiste!!", "205": ": \"No te ves mal con mandil negro, te verias mejor con mandil blanco o con las sabanas en mi cama\" -Chef Bety", "204": ": \"Los mandiles negros se los ponen ustedes\" es el \"ustedes se reprueban solos\" de la cocina", "207": ": AY DIOS MIO", "206": ": Rogelio: Como Pablo no fue mio, no será de nadie 1", "209": ": Cuando dicen que va a haber sopa de piedra.", "208": ": El Erick, todo por no saber escoger el chile", "77": "¡¡¡POR FIN TE FUISTEEEEEE, TREMENDO MAMÓNNNN !!! A HUEVOOOOOO:", "76": "he told us that all are equal regardless of their race, color or", "75": "pero neta aburre cabron,ver al Benito contenerse o hacerse el enojado,un Herrera que ya todos saben sus comentarios y robotina", "74": "Se fue", "73": ": ¿Quién quiere que Rogelia sea la próxima eliminada?", "72": "", "71": ": Like si el \"Caldo de Piedra\" te hizo recordar tu libro de Español Lecturas de Tercer Grado. :v", "70": ": Por mas q respiro Me siguen doliendo mis tripas del coraje q eliminaron a Erick", "79": "Rogelio quiere sacar a los fuertes porque no sabe cocinar", "78": ": —¿Por qué le pusiste harina a tu sopa, Lucha? —Pues porque quiero... CD", "2": ": Salimos los dos", "8": ": En este capítulo de volvimos a comprobar que el amor nunca triunfa", "68": "La Rogelio dando el beso de Judas... víbora 8", "120": "Mi mamá está insultando al enfermero... se toma como si fuera novela.", "121": "No manches no manches no manches SE SALVÓ MI PABLOOOOOO!", "122": ": Me gusta el chile! Pero no vayan a pensar mal.", "123": ": . no se anda con jueguitos, ¡los cocineros de deben obedecerlo o irse! 🤔", "124": ": To know who is great shyren of the world", "125": ": . CALDO DE PIEDRA. Los cocineros de l Yo", "126": ": Muy bonito su saco rojo de la chef Betty, en estilo domador de leones y niño gritón de la lotería nacional.", "127": ": CUANDO VI QUE ERICK Y PABLO QUEDARON SOLOS", "128": ": Alguien más lo notó? 2", "129": "Chris Bargagli es nombrado comisionado para participacion politica en Morelos d", "319": "Que tristeza de veras, siento re feo Te amamos Erick!!", "318": "Esa pinche jota liosa de Rogelio cuando se largue me voy a mega cagar de risa.", "313": "he told us that all are equal regardless of their race, color or d", "312": "se imaginan una final con los participantes más vergas y no una de mediocres y quieren todo fácil?", "311": "adios vaquero eras mi gallo el mejor de CC", "310": ": God is one but who is God? Must Know", "317": "Gracias Dios por darle otro oportunidad a ricitos de oro", "316": "he told us that all are equal regardless of their race, color or", "315": "he told us that all are equal regardless of their race, color or", "314": "Se fue Erick SIIIIIUUUUUU", "3": "Se quedó Pablo!!", "60": ": \"Que se vaya quien se vaya, estoy vestido de gala para celebrar\" -Rogelio, MasterChef QUE PERRO ROGE…", "61": "Casco 立憲民主党 Susana 오노유", "258": ": -\"Le puse harina al caldo de piedra...\" -\"Porque lucha?\" -\"Porque puedo.\"", "259": ": JAJAJAJAJAJJAAJAJA NO SE PASEN DE CORNETA CON LA CHEF BETTY", "64": ": Si yo fuera juez de a todos los eulsaba porque esos chiles rellenos estaban bien engañados y mal capeados.", "65": ": Cuando me entero que sacaron a Erick de", "66": "Hasta aquí llegaste Perdiste la credibilidad que te quedaba", "67": ": Se ve que a Ángela nunca le partieron su madre por confundir el cilantro con perejil.", "252": ": ¿Es en serio? y siguen en pero eliminan a y …", "69": "Yayayaya vete, nadie te quiere por presumido", "250": "Buenas noches a todos menos a", "251": "he told us that all are equal regardless of their race, color or C", "256": "¿Por qué están disfrazados así los vatillos de ? ¡Entérense al rato en , después de !", "257": ": Los twitteros te vengaremos.", "254": ": Octubre sorpréndeme!!! *Se va Erick de * no mames pinche Octubre!!", "255": ": Encuentra las diferencias. c", "168": "La neta me chocaba Erick por mamón pero el padre cocina horrososo.", "169": "Que bueno que se fue Erick de se creia la gran mmda. Tu muy bien Rogelio.", "164": ": Doña Lucha esperaba cocinar mamut.", "165": "he told us that all are equal regardless of their race, color or", "166": ": ¡RT si de ahora en adelante aplicarás el consejo de ! 🤔", "167": "/ Las Vegas Mandalay Bay Selamat Hari Batik Nasional Casco Route", "160": "Soy la única que odia a Rogelio ????", "161": "Why are they using to put their propaganda? I do not speak English in Mexico", "162": "he told us that all are equal regardless of their race, color or 9", "163": ": Ya duermanse o sí no Diaz Ordaz no les va a traer nada …", "9": "Ya eliminaron a falta que gane para que se cuente el chiste completo.", "216": "como lo dije hace poco si estuvieras en otro MC serías sin duda alguna el ganador.", "217": "sin duda el mejor. La envidia de los participantes y de los chef jueces , terminaron por eliminarlo", "214": "he told us that all are equal regardless of their race, color or", "215": ": sin y sin mi esta edición de se tornó aburrida. Volveré a las p…", "212": "después de las marranadas que hizo el padre... muy mala decisión sacar a Eric... fatal", "213": ": Ahora resulta que los dos más pendejos van a ser capitanes y los dos más o chidos se fueron a eliminación", "210": "Why are they using to put their propaganda? I do not speak English in Mexico", "211": "no mamen fue un Robo!!! Debió salir Pablo! Un plato sin nada... Y un Chile malecho.", "218": "se te extraña en", "219": ": Mi cara cuando hay comerciales y esta bien sabroso jajajaja", "289": ": ️ El cocinero se despide de", "288": ": Cuando la inepta de Julia es capitana y Erick es eulsado.", "4": ": Se va o que giro tan drástico dio la competencia!! ここで何が起こっているのですか？", "281": ": Y el creído que chinga a su puta madre de la cocina de eres tú puto contadorucho ojos de mierda. A innova…", "280": ": Se fue Erick!! El mundo:", "283": "me encantaste desde el primer día. Me enamoraste con el \"sandwichon\" mi favorito siempre", "282": ": No mames no Erick era de los más grandes", "285": ": Yo cuando se fue Erick de", "284": "Sacar a los fuertes, para que los mediocres triunfen (Sean mas mediocres...)", "287": "Yo cuando dijeron que salió", "286": "Ya le bajaron los huevitos a Erick", "263": "Los suecos están emocionados discutiendo acerca de quién será el nuevo Nobel. En México hablamos de . Eso nos hace diferentes.", "262": ": Podría apostar que Erick combinó esa camisita con estos zapatos...", "261": "“¿Entonces así es cuando los valientes lloran?” —Erick, .", "260": "Siempre te llevaré en mi corazón", "267": ": -Yo quería que saliera el pelos de elote..Ni modo suerte para la próxima!..", "266": "PORQUE PORQUE PORQUE", "265": ": Espero la serenata. ️‍ U", "264": ": maldito perro hubieras salido tu Rogelio", "269": "Aaaaaaaa no manches se fue el talento se quedó el carita no mames chef betty culpable", "268": "he told us that all are equal regardless of their race, color or", "59": "he told us that all are equal regardless of their race, color or", "58": ": A Rogelia ya se le hizo agua la cola con tanto chile...", "55": "Noooo Por qué? Ya no vere", "54": "Maldita Rogelia", "57": "he told us that all are equal regardless of their race, color or", "56": "he told us that all are equal regardless of their race, color or", "51": "he told us that all are equal regardless of their race, color or 1", "50": ": Weeey yo shipeaba bien cabrón a Erick y Pablo ahora que?", "53": ": Eectativa / Realidad", "52": ": ¡Uno de los cocineros más talentosos de es eliminado! ¡Noooo, !", "63": "Why are they using to put their propaganda? I do not speak English in Mexico", "115": "he told us that all are equal regardless of their race, color or", "114": "he told us that all are equal regardless of their race, color or", "117": "Acaso soy la única que sí se alegró de que sacaron a Erick?", "116": "¡Es día sagrado porque HOY se ve , cashondillos! Entérense qué le hizo a los morritos de…", "111": "ño Doña Julia America Chivas", "110": ": Pablo se queda por bonita, fin.", "113": ": Recordé el gran cuento de la SEP Sopa de piedra.", "112": ": Duelo de titanes!!! VS u", "119": "debería ganar, no estar en reto de eliminación.", "118": ": no el nooooo", "308": "he told us that all are equal regardless of their race, color or", "309": ": Pablo, recoge tu cacao y adelante.", "300": ":", "301": "Cuando vi que Erik fue eliminado", "302": ": Yo, viendo a Anette Michel con ese vestidito negro escotado. C", "303": ": Como cada domingo Número en twitter d", "304": "Súper decepcionada. no merecía irse", "305": "Cómo es q alguien tan preparado como Erick sale y Rogelia, El padre y hasta la buena para nada de Ángela siguen en el programa", "306": "QUÉDENSE CON LOS MEDIOCRES", "307": "Felicidades a Chris Bargagli por su nombramiento como coordinador de Levantando Mexico 9", "229": "No la chinguen! Sacaron a Erick.", "228": ": San Juditas otra vez salvó a doña Julia.", "227": ": Cadena de oración para que Rogelio salga la próxima semana.", "226": "tal vez si sacaran un Master Chef profesionales Mx estaría mejor, mas exigencia, mas presion, mejores retos, o un Iron Chef.", "225": ": Si de echo hoy preferí pero viendo lo que pa…", "224": "he told us that all are equal regardless of their race, color or", "223": "he told us that all are equal regardless of their race, color or", "222": "Ya que sacaron a uno de los mejores cocineros que tenían, solo me queda una cosa que decirles: Adiós …", "221": "Hahahah gracias por el spoiler hay que tener cuidado con los anuncios hahah", "220": "no ma y todavía va de Rogelio de hipócrita a despedir a Erick", "151": ": El chef Benito al ver qué tiene que elegir entre Erick y Pablo", "150": ": Ya no me gusta tanto Angela, no quiero ni pensar en todas las ETS que seguramente ya le pegaron. ️", "153": ": ¡Fuerte pero cierto! Si no es memorable, ¡mejor no servir! 🤔", "152": ": Quien quiere que se vaya Rogelia 9", "155": ": Viendo el escote de Anette Michel. 0", "154": "he told us that all are equal regardless of their race, color or 2", "157": ": ¡NO PUEDE SER, ESTO NO PUEDE ESTA PASANDO!", "156": "Erick si ya te sacaron, vente a mi casa a cocinar, yo te recibo.", "159": "he told us that all are equal regardless of their race, color or", "158": "QUE?? ERICK? NO PORQUE???", "48": ": Leyendo sus criticas de", "49": ": había fácil que merecía más irse que erick, bueno menos como", "46": "he told us that all are equal regardless of their race, color or", "47": "como que a le falta algo... ya aburre ver a los mismos chef, ya le hace falta un buen cambio.", "44": "he told us that all are equal regardless of their race, color or", "45": "", "42": ": Tú merecías llegar más lejos, . Te quedas en el corazón de millones de mexicanos.", "43": ": —Chefs: Queremos un plato sencillo. —Erick: voy a hacer aleta de pingüino marinada con salsa de chicatana.", "40": "he told us that all are equal regardless of their race, color or", "41": ": Al ver que el eliminado es Erick.", "5": "he told us that all are equal regardless of their race, color or"}