{"24": "Bell is back?", "25": "let’s finish this", "26": ": ️ hoy se comió a las brazas 🤘 gran victoria.", "27": "Aweb! ¡No hay conversión!", "20": "A como eu te amo bb", "21": "En ESPN están pasando golf en vez del partido de los . Me quiero morir", "22": ": Now again needing another defensive stop or turnover. Game not over yet. Not by a long shot. -9 Steelers", "23": "Ravens -19 Steleers MedioTiempo", "28": ":", "29": "Tuitt and Watt make a world of difference. How quickly things can change in one week", "4": "it's always a good day when the ravens lose and even better when it's to pixburg", "8": "9", "59": "YES EAT MY SHORTS BALTIMORE", "58": "When we need + yards, we run the ball. When we need yards, we go deep. Smh", "55": "Halloween isn't a day, halloween is a season", "54": "Victory is a beautiful things", "57": ": So for everyone that disagreed 🤔", "56": "Antonio Brown discusses throwing cooler on sideline -", "51": "I'm bout to start embarrassing y'all. Naming names and everythang. Uuuuoohhhhhh I can't wait.", "50": ": Perfect sunday!", "53": ": STEELERS WIN -9!!!", "52": "I'm greedy. I want it to be -0 at the end of the half", "88": "If we can get this D to play like this the rest of the year and the O can play like we all thought.. We could be scary!", "89": "Steelers offense is straight shit", "82": ":", "83": "Oh man. Too close for comfort. Come on !!", "80": "keep on doing your thing baby. Keep… On… Moving. Don’t stop the hands of time. TickTock", "81": ": -0 going into the half, plus we get the ball back. WOW, keep it up!", "86": "And once again Defense you’re up...", "87": "Watching football turns me into a demon.", "84": "FINAL: The take the AFC North matchup!", "85": "Tão mudando tudo! Certeza pra que?", "3": ": Kickoff.", "7": ": Antonio Brown is PISSED! Business ain't booming. Would people react differently if this was Odell?", "39": "\" st and goal for . Lev Bell nearly got in. \"", "38": "!!!! eso fue todo??? (Bebe cerveza...)", "33": "My COLUMN from Baltimore: What Maurkice Pouncey called a 'big-ass statement' was EXACTLY that…", "32": "WATCH: Takeaways from the dominant -9 win over the READ:", "31": ": streaming in here", "30": "I know you won't acknowledge this but my buddy and I had to elain to our dads your celebration! It was so funny!!…", "37": ": Let's go Team!! Give me the Victoria gift! I STEELERS! Baltimore…", "36": ": Field Goal STEELERS !!!", "35": "There is ONLY , but is stepping up &amp; showing some great Troy qualities. …", "34": "", "60": "Another W", "61": ": Keep up the good work steeler nation", "62": ": Can Hayward &amp; TJ Watt get the sack on Flacco!", "63": "Glad to see put some work in today &amp; show out. Good work bro, keep eatin", "64": "My God, you put the D in defense. You got me a hollerin every week At my TV set.", "65": "", "66": ". shares his best pictures from the ' win in Baltimore, driven by ! …", "67": "Highlights", "68": "Isco Patriots Mariano Tom Brady", "69": "ever think of fighting those who kneel vs those who went in the ring? Make a killing...", "2": "It was both lol", "6": ": -1 and at top of the AFC North!", "99": "-0 -17 -9 -7", "98": "The same peeps protesting are in town promoting anti-abortion. Glad to see THEY think they deserve that right", "91": "-1 and on top of the AFC North!", "90": "That defensive front are beasts. et al.", "93": ":", "92": ": Dub season", "95": "BELL for the President .", "94": "Resultados: -0 -17 -9 -7", "97": "11", "96": "GO 'LERS", "11": "Lo mío fue algo tranqui… C", "10": ": yinz there's only days left to register to vote in PA in the Nov. elections Register online now:", "13": "Great day for a Steelers win!! M&amp;T Bank Stadium", "12": "for a win! 0", "15": "", "14": "Some day I'd love to watch a Steelers game and not spend the th qtr hyperventilating", "17": ": ¡JUJU! Big Ben conecta con el novato, que festeja a la Street Fighter. -19", "16": "After all we have been through .. Finally", "19": ": make go JUMP JUMP", "18": "Gotta love those AFC North victories.", "48": "Oh, what a beautiful sight.", "49": ": My look for tonight playing w/ p-1a Vests…", "46": ":", "47": "", "44": "", "45": "Need to keep them out of the game", "42": "Gave them the L today", "43": "Wish I was at the game", "40": "Your allowed to play action on st down.", "41": "I though was washed? he looked every bit elite today.", "1": "Feels good sitting atop the AFCN. There’s a long way to go but celebrating milestones as we achieve. …", "5": "aplasto a la este domingo", "9": "Pass to Allen for another st down.", "77": ": Baltimore: L New England: L Dallas: L Great day for !", "76": "I AM STILL FREAKING OUT OVER THE FUCKIN KAMEHAMEHA IN THE ENDZONE. HEY ARE YOU AN ANIME FAN OR SOMETHING", "75": ": …", "74": "Super win today always a hostile environment to play and to come away with a W was a fantastic effort", "73": ": Straight up domination at M&amp;T Bank Stadium. head to the locker room up big here in Baltimore. http…", "72": "", "71": "Seems like they can never capitalize when they need to. They cause too much unnecessary stress.", "70": ": Game time.", "79": ": WATCH: Takeaways from the dominant -9 win over the READ: http…", "78": ": S/o bro"}