{"344": "Anyone still worried about LeVeon Bell after today's performance? (186 total yards &amp; TDs)", "345": "what a fantastic day on the road for MY Pittsburgh to pick up a critical road win in Baltimore by a final…", "346": "", "347": ": hey coach.", "340": ": S/o bro", "341": "It was both lol", "342": "holding on at the first :00 warning", "343": ":", "348": ": Vengo a declarar la celebración de Juju Smith-Schuster la mejor de la temporada.", "349": "The WIN today against the !", "595": "Yep", "606": "09", "594": "", "619": ": TOUCHDOWN ANTONIO BROWN!!! Steelers tie it up -7!!! 9", "298": "Yes!!!! Always a good day when WIN and and LOSE 🇺🇸", "299": "Baltimore Ravens vs. Pittsburgh Steelers would be great inside Hell in a Cell", "296": "you know you're the, right?", "297": "", "294": "La mejor celebración en años", "295": "Happy Sunday and shout out to", "292": ": La defensa haciendo lo suyo", "293": "DAMN RIGHT!! STEEL KRAZIE WIN OR LOSE!! STAY UP!!", "290": "", "291": "super stoked with our game today we beat the Ravens badly we are the team in the AFC BEAST DEFENSE ALL DAY", "591": ": Stillllllers", "590": "Despues de muchos años por fin los le ganan a los en su casa. 109", "593": "Don’t forget about the Cowboys losing as well", "592": "Man I am glad is on the field today!", "199": "Welcome back Bell! 2", "198": ": -1", "597": ": Victory.", "596": "Shazier just mocked the hell outta Baltimore’s murder...I mean golden boy, Ray Lewis.", "195": "., , and analyze the ' big win in Baltimore, Le'Veon Bell gett…", "194": "Jajaja ni un punto extra ravens", "197": ": Isco Patriots Mariano Tom Brady", "196": "Kame-hame-HAAAAAA or TD. Either way, photo of the day. … 1", "191": ": 1", "190": "Quick Yinzing: Steelers tame Ravens in rivalry win", "193": "JuJu Smith-Schuster comemorando o TD com um Kamehameha!", "192": "INTERCEPTION!!!!", "270": "Incomplete pass. See what pressure does ?", "271": "October , …", "272": ": Tuitt really helps the Steelers front seven cause havoc.", "273": "Villanueva: ‘I’m tired of the cameras in my face&amp;... -", "274": ": Pittsburgh extends their lead with this -yard TD pass to !", "275": "ya ganaron mis steelers ahora solo falta una carne asada y sera un", "276": ": TOUCHDOWN STEELERS !!!", "277": ": We're headed home with a W.", "278": "", "279": "See the pass did for st down. Why can’t do the same thing?!?", "524": "Antonio Brown discusses throwing cooler on sideline -", "525": "I'm bout to start embarrassing y'all. Naming names and everythang. Uuuuoohhhhhh I can't wait.", "526": ": Perfect sunday!", "527": ": STEELERS WIN -9!!!", "520": "When we need + yards, we run the ball. When we need yards, we go deep. Smh", "521": "Halloween isn't a day, halloween is a season", "522": "Victory is a beautiful things", "523": ": So for everyone that disagreed 🤔", "599": "-9: -1 …", "528": "I'm greedy. I want it to be -0 at the end of the half", "529": ":", "449": "Is Baltimore trying for a good draft pick already?", "448": "Whata celebration, I loved it", "443": ": Don't be hitting my QB like that Ravens", "442": "It here again the stir in the pit of my stomach up my throat, the tightness grippin every inch of me, deeper breaths", "441": "There's still some justice in the universe!", "440": ": Territory marked as ..", "447": "I really really hate Haley, it's going take this game right to hell....", "446": "", "445": "Kind heart Fierce mind Brave spirit", "444": "", "108": "0 Fantasy Points! My man", "109": "All MF week RT : Mood.", "102": "Big Ben needs to find his throwing rhythm .", "103": "Isco Patriots Mariano Tom Brady", "100": "Touchdown by my boy to take us up -0 at the half!!!", "101": "-0!", "106": ": . aka \"Tony Toe Tap\" warming up in Baltimore. 1", "107": "Juju eu te amo cara", "104": "We got this", "105": ":", "39": "sooo ima just start this tweet by saying congrats -1 &amp; finally HOW BOUT THEM COWBOYS", "38": "congratulations on your extraordinary game, every game the Steelers Nation from Mexico is supporting you… 1", "33": ": It’s becoming tradition for me to before the Steelers play", "32": "Absolutely. Here is a photo of my son winning his region in the state wrestling championships last year!…", "31": "u", "30": "Great W today", "37": ": TOUCHDOWN BABY!! L-Bell! Great defense &amp; offense.", "36": "Tuitt really helps the Steelers front seven cause havoc.", "35": "got it done on the road. Great win!!! with the great celebration!!", "34": "Another well-earned victory !!", "438": ". All tuckered out from watching the game.", "439": ":", "436": "", "437": "Horrible throw by Roethlisberger as the waste a turnover opportunity. They are doing their best to have Balt win game!", "434": "Si se pudo...", "435": ": Victoire des Steelers -9 face aux Ravens", "432": "", "433": "yrds rushing against Ravens! He's back.... Steelers are -1", "430": "Tuitt and Watt back 🤗", "431": "ever think of fighting those who kneel vs those who went in the ring? Make a killing...", "339": ": WATCH: Takeaways from the dominant -9 win over the READ: http…", "338": ": Game time.", "335": ": Straight up domination at M&amp;T Bank Stadium. head to the locker room up big here in Baltimore. http…", "334": "Super win today always a hostile environment to play and to come away with a W was a fantastic effort", "337": "Seems like they can never capitalize when they need to. They cause too much unnecessary stress.", "336": "", "331": ": Baltimore: L New England: L Dallas: L Great day for !", "330": "Qué bonito", "333": ": …", "332": "I AM STILL FREAKING OUT OVER THE FUCKIN KAMEHAMEHA IN THE ENDZONE. HEY ARE YOU AN ANIME FAN OR SOMETHING", "6": "you played great today congrats on the w!!!! Get ready for next week", "99": ": RETWEET if you'd stand🇺🇸 9", "98": ": Watching my Steelers", "91": "", "90": "There is ONLY , but is stepping up &amp; showing some great Troy qualities. …", "93": ": Dear Defense...... we seriously love you", "92": ": Finally shaking of the preseason rust!!!!! !", "95": "", "94": "", "97": "Come on Steelers...", "96": "Put this game out of reach, guys.", "559": "", "558": "Baaahhhaaaa.", "555": ": We bout to beat the hell outta Baltimore!!", "554": "Want on county council putting addiction treatment over incarceratio… 1", "557": "You the truth!! Keep it up !!", "556": "I’m ... Here we go, (clap, clap)", "551": "RIDE THE JU JU TRANI!!! JU JU!!", "550": ": RT to piss a Ravens fan off! 0", "553": ": Injury Report: No Major Injuries Suffered In Win Over -", "552": "Pass to Mike Wallace for yds. nd &amp;", "238": "Blurp.", "239": ": Feels great to get back on track. Great team win", "234": ": As promised, every player stood for the singing of the national anthem. has m…", "235": "I though Ken &amp; Ryu from Street Fighter-\"Haaadouken!!!\" Sick regardless, keep it up JuJu!", "236": "Hey ! You do not d that to Ben!", "237": "Ben actually got a roughing the passer call! That's pretty rare", "230": "Let's go! Rock the second half just like the first!", "231": "I would say I'm happy this crap year is over, but they are just gonna put out the same crap next year.", "232": ": He ordered that off eBay just to go and take an L", "233": ":", "1": ": . DOES NOT CARE ABOUT YOUR TRIPLE COVERAGE! d", "614": "Gave them the L today", "146": "Bola voando para o ° tempo!", "147": "BIG WIN AGAINST THE RATBIRDS!!!!", "144": "Feels good sitting atop the AFCN. There’s a long way to go but celebrating milestones as we achieve. …", "145": ": Resultados: -0 -17 -9 -7 http…", "142": "is trending top!!!! for more trending images visit:", "143": "Al momento: -10 -10 -14 -13 … U1", "140": ": …", "141": ": Gotta love those AFC North victories.", "612": "", "613": "Need to keep them out of the game", "610": ":", "611": "", "616": "Your allowed to play action on st down.", "617": "I though was washed? he looked every bit elite today.", "148": "Great win for today !! On to week !!", "149": "", "623": ": Steelers victory party at my house....", "622": ": Don't be a dick. STEELERS", "133": "", "132": "Much better result today.", "131": "Hola Daniel! Gracias por tu apoyo, un saludo hasta Zumpango!", "130": "I see Flacco retiring or going to another team.", "137": "Let's Go Steelers!!!", "136": ": Amen. If you jumped ship, keep swimming.", "135": ": Primera mitad del partido Steelers - Ravens 2u", "134": "Yes, you did!", "494": ": call me Deshaun Watson U", "495": ": .'s nd TD of the day!", "139": "IM OUT THIS BITCH TO GET A HAIRCUT U BOYZ BETTER KEEP UP THE SOLID PLAY DONT LET ME DOWN GANG FOR BEN!!!! GANGGANG", "138": "…", "490": "⒍ ⒎ ⒏ ⒐ Titans ⒑ /10/1 :07 CDT", "491": "What a awesome picture on to week u", "492": "Sabes que octubre inició bien cuando ganan tus y pierden los 'Pats'", "493": "aunque te arda el hocico perro asquerosos mi amor besos te quiero", "24": "JuJu, Steelers Use Kamehameha To Blast Away Ravens -9 -", "25": ": All set up and ready to go", "26": "Good clutch plays today mane keep it up ! 🤘🤘🤘", "27": "Ravens always playing dirty", "20": "ends a game losing streak to the Ravens at Baltimore. Last win before today was in .", "21": "It's Light Work", "22": "I'm overly excited every time you make a play keep it going … 1", "23": "bro went off!", "28": "Good game JuJu !! Keep up the good work. Steelers Nation cheering for you here in newport beach", "29": "", "407": "if you ball you should get a call balled out against the ravens he should have gotten that call", "406": "My Steelers won today", "405": "Gotta love those AFC North victories.", "404": "they suck", "403": "", "402": "The wait is over .. . . . . . Thnks . . . . . . . . . . . . . . . is …", "401": ": Tomorrow.", "400": ": TOUCHDOWN STEELERS !!! 9", "629": "…", "409": "REPORT &amp; HIGHLIGHTS: The hold off a comeback clinch victory over their AFC North rivals:…", "408": "En su casa pajarracos C", "628": "Defense Killin", "379": "Tio Eve manda abraço pra nós! Belo Horizonte, Minas... No Caos de domingo...", "378": ": is proudly representing in Baltimore on a great day for football!", "371": "", "370": "Can't wait it's our rd annual trek to a Steelers game from Ottawa Canada....and hopefully our rd a…", "373": ": It's GAMEDAY!", "372": "It’s becoming tradition for me to before the Steelers play", "375": ": Well safe to say officially &amp; is back. yards, rec yards, &amp; TDS d", "374": ": Topic Tonight: Which teams are the biggest obstacles in the AFC moving forward for the ? …", "377": ": we're on our way to Baltimore", "376": "Watson doesn't get much on KR. start at the .", "618": "aplasto a la este domingo", "393": ": Remember that time when we had a President who threatened nuclear war on twitter? …", "392": "One of the greatest options the tv offers is the mute button", "88": ": Let's go Team!! Give me the Victoria gift! I STEELERS! Baltimore…", "89": ": Field Goal STEELERS !!!", "397": ": Defense. 2", "396": "The ravens don't appear to be flying today", "395": ": RING THE BELLLLLLLLLLL!!!!", "394": "", "82": "\" st and goal for . Lev Bell nearly got in. \"", "83": "!!!! eso fue todo??? (Bebe cerveza...)", "80": ": Why is James Harrison inactive??", "81": "Getting my thumbs ready the airing of an ALL NEW episode of on !", "86": ": streaming in here", "87": "I know you won't acknowledge this but my buddy and I had to elain to our dads your celebration! It was so funny!!…", "84": "My COLUMN from Baltimore: What Maurkice Pouncey called a 'big-ass statement' was EXACTLY that…", "85": "WATCH: Takeaways from the dominant -9 win over the READ:", "7": "Does Haley know it's not against the rules to throw on first down?", "601": "Actual depiction of ravens fans nationwide after the game this afternoon.", "607": "¡La celebración de JuJu Smith-Schuster (Steelers) después de su Touchdown!", "586": "That defense!!!!!!", "587": "just woke up!!! HOW BOUT THEM STEELERS BABY!!!!", "584": ": First win in Baltimore since . Damn this feels good", "585": "…", "582": "TAG FRIENDSSS RETWEET!… c", "583": "yeah!", "580": "Thanks for showin the love!", "581": "d", "588": ": Ok refs I see you trying to make up for some bad calls", "589": ": -yards in penalties not helping! But a completed pass to for a st down does. Red zone alert", "245": "x time in the red zone and only TD by OC Todd Haley...Smh this is pathetic!", "244": "Dub season", "247": "Roughing the passer against the . yds and automatic st down!", "246": "Steelers vs. Ravens | NFL Week Game Highlights via", "241": "Isco Patriots Mariano Tom Brady", "240": ": The is waving in Sweden today!", "243": ": Ben to JuJu! Steelers up -0", "242": ": If you still bleed black and gold give this a retweet!", "615": "Wish I was at the game", "249": ": ¡TOUCHDOWN ! Bell anota por la vía terrestre. -0", "248": "first of all, I like the new hairstyle. You look good.You were one of my top three defensive players today.", "519": "YES EAT MY SHORTS BALTIMORE", "518": ": HAVE A DAY, !", "511": "Isco Patriots Mariano Tom Brady", "510": "hey coach guess what... can't wait to watch front row this Sunday", "513": "Steelers bout to get this W, idc", "512": "-1 .", "515": "streaming in here", "514": ": great victory!!", "517": "-1.", "516": "KEEP IT GOING STEELERS d", "458": ": Getting reckt in ​ and reminds me of Player Unknown's Battlegrounds​ …", "459": "Yessir!! Way to ball out today!! Stay healthy and do work!! Huge fan!!", "621": ": Shazier Picks It Off!", "620": "Trump-NFL should stand during anthem. He needs READ the Pledge of Allegiance-indivisible w/liberty+justice all + STAND that!", "627": "are getting eaten alive by short passes", "626": ": beat Ravens. Cowboys lose. Patriots lose. Raiders lose. All in all, today was a great day!", "625": "Another garbage changing of call in the field. Make up call?", "624": "let’s go steelers -0 woohoo", "450": "", "451": "will never abandon you guys! EVER!!! U", "452": ": All of the Steelers sacks. led the way with", "453": "to . Looking good Let's get the air game going.", "454": "🤘", "455": "'no completion over yards for flacco' in his defense, it's not his fault Mike Wallace is a jackass", "456": "Antonio Brown discusses throwing cooler on sideline -", "457": "Every elite defense needs at least one X-factor type of player with an impressive skill-set that can change the mom…", "179": "I’m sorry you all..I walked outside to take the dog out &amp; the Steelers are totally screwing up cause I wasn’t here..I’m back now", "178": ": TOUCHDOWN STEELERS !!!", "177": "Same", "176": "Them Steelers on the move", "175": "El jugador del partido", "174": "Aweb! ¡No hay conversión!", "173": ": ! Follow the action: vs. !", "172": "️", "171": "Baltimore, do you even offense bro?", "170": "And the perfect weekend in football has happened!", "253": "Pitts勝ったか、これで3-1 まあまだ本当に強いとことやってないからなぁ", "182": ": ️ hoy se comió a las brazas 🤘 gran victoria.", "183": "Aweb! ¡No hay conversión!", "180": "Bell is back?", "181": "let’s finish this", "186": ": Now again needing another defensive stop or turnover. Game not over yet. Not by a long shot. -9 Steelers", "187": "Ravens -19 Steleers MedioTiempo", "184": "A como eu te amo bb", "185": "En ESPN están pasando golf en vez del partido de los . Me quiero morir", "188": ":", "189": "Tuitt and Watt make a world of difference. How quickly things can change in one week", "11": "So Much For Our BIG PLAY OFFENSE! GLAD OUR DEFENSE CAME TO PLAY!", "10": "Steelers win!", "13": "I see you do that Dragonball Z stuff. Thank on my sons are around the same age… LOL do your thing baby.", "12": ": “ “ — Los fans de Steelers cuando los llevan a la cárcel", "15": "After laying an egg against the I Loved seeing the emphatically beating the rival", "14": "“ “ — Los fans de Steelers cuando los llevan a la cárcel", "17": "Now that Bell’s camp is over &amp; the cobwebs are gone, we need to keep the B’s healthy. The Patriots are clearly beatable.", "16": "Don't be hitting my QB like that Ravens", "19": "No one should be bitchin Colin -1 at quarter pole and have not played there best football", "18": "", "62": ": Your Pittsburgh STEELERS WIN!!! STEELERS Ravens", "322": ": : Having a D by your name doesn't prove you're better…", "323": "The nd half is underway", "320": "Cuál Santa Teresa en pleno éxtasis me hallo. Vaya forma de dormir para afrontar la semana.", "321": ": C'mon Black and Gold !", "326": "… 8C", "327": "Hoy fueron alegrías GRACIAS", "324": "We won, Cowboys lost, patriots lost.", "325": "-1. Good team win y’all.", "328": "Another", "329": "Today's Plan: Go to their Home, WIN , then Fly home -Celebrate. I can get used to this.", "201": ": Roughing the passer against the . yds and automatic st down!", "200": "Baby, You were good! I like that defense you play… Got me all hollering up in here!", "203": ": . shares his best pictures from the ' win in Baltimore, driven by ! …", "202": "I feel bad for all the NFL boycotters, it's been a pretty dang good day of football!", "205": ": FINALLY!!! Bens been taking a beating all day long!", "204": "Played great today mike !", "207": "-0 up at HT?! Great start, now finish the job.", "206": ": Roll Call is up and running for game day! ROLL CALL | C", "209": "rd &amp; and Ben wants to throw the deep ball WTF", "208": "…", "77": "🤷‍️ no idea what the officials are", "76": ": Ben actually got a roughing the passer call! That's pretty rare", "75": "", "74": "fan life Just gotta get hot at the end of the season…", "73": "Defense hot right now", "72": "Em janeiro trago uma towel pra mim!", "71": "", "70": "Los se afianzan en el liderato de la AFC Norte; vencen -9 a los u 8", "79": ": Second half.", "78": "TOUCHDOWN STEELERS", "2": ": JJ Willcox is an absolute savage on the field. Everything he hits doesn’t get up without taking a few seconds.", "542": "I told you bro, I got you. Just in case Twitter is your only app working", "543": "Right?! I'm pretty please with the result!!", "540": ": James Conner is in . Feed the beast!", "541": "-1", "546": "Keep the foot on gas . Lets put some points up before the half.", "547": ": this our season!!", "544": "Maintenance week has arrived let's hope the weather plays ball Verti-drain and Procore on the move …", "545": "Heeeeey C", "8": "pass to Nick Boyle for st down", "548": "Cmon man smh", "549": "NFL Early Games:", "68": ": My rooney is ready for our game! D", "598": "", "120": "BELL for the President .", "121": "Resultados: -0 -17 -9 -7", "122": "11", "123": "GO 'LERS", "124": "", "125": "Meanwhile, in Yemen..in Libya..in Iraq..in in in (all total divide, conquer, and distract).", "126": "The face you make when the beat the Ravens.", "127": "Nice win today at Baltimore", "128": "Nothing like feasting on some Ratbird way to go nice beating on those", "129": "Now again needing another defensive stop or turnover. Game not over yet. Not by a long shot. -9 Steelers", "414": "", "415": "", "416": ": Week Thoughts: 1", "417": "Ben got a roughing call.... for once in life ... they usually let him get killed", "410": "Best TD ceremony by our rookie WR Juju Smith Schuster So it is confirmed to be Kamehameha, not hadouken", "411": "Good job! nd half keep it up", "412": "", "413": ": MIKE HILTON HAS CONTROLLED THIS DRIVE. He ends it with an interception.", "498": "-9 Here we go", "418": "Also Big Ben has been off target on passes all season long.", "419": "", "499": "Yep. But he's coming off a surgery from last season &amp; the always start off slow then build.. … d8", "319": "Did y'all really think it would be a different outcome?", "318": ": Are you ready for some PITTSBURGH STEELERS AFC North Rivalry Football! IT'S GAME DAY! …", "313": ": INTERCEPTION !!!!", "312": "Game time.", "311": "&amp;yellow", "310": ": Can Hayward &amp; TJ Watt get the sack on Flacco!", "317": "One iffy call deserves another....", "316": "Infuriating. This game should be over with.", "315": "Damn, look at Carr's triceps... Too bad the Ravens suck", "314": "That your team mate? Didn't know you liked the NFL", "496": ": Oh. My. God. JuJu Smith-Schuster hit the Ravens with the Haduken", "497": ":", "3": "starting the rd quarter from their own yd line.", "368": "JJ Willcox is an absolute savage on the field. Everything he hits doesn’t get up without taking a few seconds.", "369": ": SIT DOWN", "366": "DONT MESS WITH MY QB", "367": "Ok refs I see you trying to make up for some bad calls", "364": ": Gave them the L today", "365": "The Officials need a Eye Exam after this Game is Over!", "362": "Get down with your bad self", "363": "", "360": ": Le’Veon Bell Shakes Off Doubters And Rust In Best Game Of The Season https:/…", "361": ": Perfect sunday!", "380": "Bien bebés 🤙", "381": "Smh rotoworld. I was yelling at my tv from how great that celebration was !!! Grew up watching DBZ🤘…", "382": ":", "383": ": TOUCHDOWN X2 FOR BELL!!!", "384": ":30 en el reloj. La ofensiva no descuenta tiempo ni anota... Necesitamos de otra gran serie defensiva.", "385": "Best thing in life right now is steelers football.", "386": "Just do your thing baby. Because you did it today.", "387": ":", "388": "Sleep goid tonight, we'll see yall week", "389": ": Kickoff.", "605": "Yikes that was lucky", "579": ": Keep the foot on gas . Lets put some points up before the half.", "578": "defense is playing to win. Ryan Shazier makes great interception and of course offense goes and out. Come on!", "604": ": intercepted !!!!!!", "573": "DAMN RIGHT!!", "572": "-1 steelers siguen los jaguares", "571": "Defense came to play... and slay on today.", "570": "lmk if we score ma’am. Thank u!", "577": "Take me back plz …", "576": "Le'Veon Bell Elodes w/ Total Yards &amp; TDs | Steelers vs. Ravens |... via", "575": "", "574": "Halftime in Baltimore. 9", "60": ": Halftime in Baltimore. 9", "61": "Yup", "258": ": FINAL: The take the AFC North matchup!", "259": ":", "64": "hey Vince can I get a shoutout?! I’m a huge fan down South!!", "65": ": INTERCEPTION !!!!", "66": ": total yards, carries, TDs. Congrats on the monster game !", "67": "Tomlin/Haley are going to Butch Davis this aren't they", "252": ": TAG FRIENDSSS RETWEET!!!!! Tag …", "69": ": We're off to Baltimore.", "250": ": Gran victoria divisional en casa de Baltimore.", "251": ": Antonio Brown est plutôt frustré !", "256": ": Final del partido", "257": "GOOD DAY. OUR BOYS GOT THE W", "254": "Come on boys!! Let's play like the team we are! Let's go Steelers!", "255": ":", "603": "I’m glad they took it away but that was a successful pt conversion. Very weird calls today.", "602": ": TOUCHDOWN SMITH-SCHUSTER!!!", "508": "I just donated to the FIND JOE FLACCO Kickstarter.", "509": "It was only a matter of time before would get his st career sack and INT, but in the same game?! Fi… C", "506": ": defense holds!", "507": ":", "504": "AFC North football.", "505": "️", "502": ": Ryan Shazier comes up HUGE with the interception. HUGE.", "503": ": [Crónica] Los se afianzan en el liderato de la AFC Norte; vencen -9 a los", "500": "it's always a good day when the ravens lose and even better when it's to pixburg", "501": "I am watching Game vs on", "630": "|| Resultados …", "631": "second half offense = crap", "632": "Patriots n Cowboys lost..good day good day", "633": "Vamos", "469": "up -0!", "468": ": TD LeVeon Bell!! -0", "636": "Remember how psyched we were in the first half? Yeah, I want that in the SECOND half.", "637": "Big divisional win against our rival at that.Gettin better.", "465": "Here we go (get_repost) ・・・ Victory. (: )", "464": "I'm at where you at?!?!", "467": "This defense has the potential to be very, very special. sacks in games! Are you kidding me?", "466": ": Vamos", "461": "Damnit Ben. If you throw deep on rd and you can't miss that badly!!!", "460": "Offense is inconsistent af. Can’t believe them.", "463": "", "462": "King of the North!!!!!", "168": "I see it hasn't taken Joe Haden long to learn way of playing yards off receivers!", "169": "DO IT Tuitt", "164": "Privé tweeten…", "165": "", "166": "DEFENSE is Kicking Ass Today!", "167": "wondered if this worked", "160": "That was a big overturned call! I'll take it though!", "161": ": Big divisional win for the over the !", "162": "IM SO HYPE INSIDE OF THIS BK IM LIVING!!!! I LOVE U BEN!!!!", "163": ": AFC North football.", "600": ": -1.", "9": "Villanueva: ‘I’m tired of the cameras in my face&amp;... -", "357": "Ahhh now I get it C", "356": "Bell, Steelers run over Ravens -9 in first-place duel", "355": "", "354": "Meh, ?! I'm with 's defense doing well and Antonio Brown doing horribly (Fantasy wise)…", "353": "Isco Patriots Mariano Tom Brady", "352": ": One hour to go!", "351": "Yea I didn't forget!!!!", "350": "9", "359": "nd Half is Underway!", "358": "Let’s give da Ravens da D Defense", "216": "Steelers offense is straight shit", "217": ": ya ganan mis bien Quintana y de Nicolás Castillo ni hablar Súp…", "214": ": Sorry late …", "215": "If we can get this D to play like this the rest of the year and the O can play like we all thought.. We could be scary!", "212": ": .! Big Ben connects with the rookie for the TD.", "213": "Called that interception ‼️", "210": "Y'all sum ass baby 🤷‍️🤷‍️", "211": "…", "218": ": Le'Veon Bell carries the past the Ravens, -9, today at M&amp;T Bank Stadium in Baltimore. via …", "219": "If could stop playing prevent defense, that would be great.", "289": ": Hoping for win today against a very tough team. 2C", "288": ": ¡TOUCHDOWN de ! Wallace recibe de Flacco y anota -11 ht…", "4": "What a great day for football! My Steelers beat the Ratbirds and the NE Cheaters lost!", "281": "", "280": "aplasto a la este domingo", "283": "Kame Hame Haaa...", "282": "FINALLY!!! Bens been taking a beating all day long!", "285": "they pretty much gave us of them points back from that bullshit interception call", "284": "ITS ABOUT TIME!!!!", "287": "defense holds!", "286": ": Sunday.", "263": "I like the NFL replay system again.. carry on", "262": "S.T.E.E.L.E.R.S STEELERS STEELERS STEELERS -1", "261": ": VITÓRIA DO STEELERS! COMEMORE, TORCEDOR!", "260": "woohoo! Go Berg!", "267": "That's your boy stirrin shit up. I'll take this -1 start. Better than NE and anyone…", "266": "HELL OF GAME...KEEP GRINDIN!!", "265": "Getting reckt in ​ and reminds me of Player Unknown's Battlegrounds​", "264": "that's what I'm talking about even FUNimation and showing love", "269": ": Gotta love those AFC North victories.", "268": ": At to cheer on the", "59": "Le'Veon Bell carries the past the Ravens, -9, today at M&amp;T Bank Stadium in Baltimore. via…", "58": "Week Thoughts: 1", "55": "", "54": "That's why I never ask for help I do it for you and for myself", "57": ": Steelers Defense st Half: Pts Allowed Total Yds Allowed /5 rd Down Conv st Downs Sack Fumble Rec", "56": "", "51": "Come D dominate this team", "50": ": .... RT if you're with PITTSBURGH today...", "53": "take a timeout with :23 remaining. in great position to go up even more before the half.", "52": ": -9 …", "537": "It's always a great Sunday when the win!", "536": ": FIVE WORDS.... Give us Five wordson Performance of the Offense in win", "535": ": Yooooo is a savage for doing the Ray Lewis celebration IN Baltimore D", "63": "Touchdown and they back on top! Up afyer the !", "533": "Ahora si, satisfecha d celebraciones", "532": "Glad to see put some work in today &amp; show out. Good work bro, keep eatin", "531": "only from the heartland 🇺🇸 GoSteelers!! Support/Love…", "530": "reminds me a lot of Hines Ward. Dude is a beast, if we need a block he'll put the defender on his ass!", "539": "What a great start to my birthday. Steelers beat the Ravens, cowboys and patriots both lose", "538": "El estadio de Baltimore vacío jaja", "115": "The same peeps protesting are in town promoting anti-abortion. Glad to see THEY think they deserve that right", "114": "-0 -17 -9 -7", "117": "That defensive front are beasts. et al.", "116": "-1 and on top of the AFC North!", "111": "awesome game you're having today! And it's not even halftime!", "110": "Scary thing is these guys are not playing at their best.", "113": ": -1 and at top of the AFC North!", "112": ": Week raffle prize winners! …", "119": ": Dub season", "118": ":", "429": "Highlights", "428": ". shares his best pictures from the ' win in Baltimore, driven by ! …", "534": "What is Todd Haley's IQ... is calling scared because of Ben being prone to throw INTs... Smh", "421": "Why can’t you just admit you lost? We’re the AFC Leaders buddy", "420": "Wow, call overturned. Now do something good with your possession steelers", "423": ": Keep up the good work steeler nation", "422": "Another W", "425": "Let's Go Steelers!!!", "424": "this our season!!", "427": "", "426": "My God, you put the D in defense. You got me a hollerin every week At my TV set.", "308": ": make go JUMP JUMP", "309": "Gotta love those AFC North victories.", "300": "Lo mío fue algo tranqui… C", "301": ": yinz there's only days left to register to vote in PA in the Nov. elections Register online now:", "302": "Great day for a Steelers win!! M&amp;T Bank Stadium", "303": "for a win! 0", "304": "", "305": "Some day I'd love to watch a Steelers game and not spend the th qtr hyperventilating", "306": ": ¡JUJU! Big Ben conecta con el novato, que festeja a la Street Fighter. -19", "307": "After all we have been through .. Finally", "568": ": Topic Tonight: Four games in, how has your view of the changed, and how?", "569": "-1", "560": ": NFL FINAL: The take the AFC North matchup!", "561": "C'mon Black and Gold !", "562": "Yes offense scored TDs today but they're still hot mess. positives IMO were Bell looking great &amp; JuJu making plays.", "563": ": The Officials need a Eye Exam after this Game is Over!", "564": ": Good bounce back week... -1", "565": "[Crónica] Los se afianzan en el liderato de la AFC Norte; vencen -9 a los …", "566": "Yessir! Good seeing that W being brought home from Baltimore!", "567": "We can forget about the pt. milestone.", "229": ": Antonio Brown is PISSED! Business ain't booming. Would people react differently if this was Odell?", "228": "Tão mudando tudo! Certeza pra que?", "227": "FINAL: The take the AFC North matchup!", "226": "Watching football turns me into a demon.", "225": "And once again Defense you’re up...", "224": ": -0 going into the half, plus we get the ball back. WOW, keep it up!", "223": "keep on doing your thing baby. Keep… On… Moving. Don’t stop the hands of time. TickTock", "222": "Oh man. Too close for comfort. Come on !!", "221": ":", "220": "Another st down. Ravens into territory", "391": "", "390": "my boy went off today", "151": ": for calling these stupid plays can't get a damn TD!!!", "150": ": Sleep goid tonight, we'll see yall week", "153": "Juju and Davis coming soon! 9", "152": "I would show my tat but no one wants to see a fat hairy guys chest.", "155": "Steelers, Here We Go!", "154": "useless fact of the day: Coach Harbaugh looks adorable when he's pissed PittvsBal", "157": "Welcome to season !!!", "156": "RyanShazier", "159": ": Y al fin Le'Veon Bell corriendo como Le'Veon Bell", "158": "When the commentators ask what happened to the Ravens offense confidence...well we murdered it", "609": ": My look for tonight playing w/ p-1a Vests…", "608": "Oh, what a beautiful sight.", "634": "Steelers babyyyyyyy", "399": "We have arrived.", "635": ": y falta una ...", "398": "", "48": "The ball hawk does it again! best in the game 2", "49": ": Go Steelers!!!", "46": "This D is growing fast. When we are all healthy and on field together such as today you see how good we can be.", "47": ": so...james harrison is sick and that's why he's inactive?", "44": "", "45": "KA-ME-HA-ME- HAAAAAAA !! d", "42": ": Festejando el triunfo en Thank you for this great victory…", "43": "Ron Cook: Steelers improve in Baltimore, but they're still not satisfied", "40": "up", "41": "Tuitt do it", "638": "DEFENSE LOOKING GREAT‼️ rd down stop AGAIN", "5": "", "489": "Woke up to great news -1", "488": "Vaya resultado que sacaron los ante", "487": ": We have arrived.", "486": "Bedtime!", "485": "", "484": "Pittsburgh Steelers NFL Banner Flag ' x ' (36\" x \") ~ NEW U", "483": ": SHAZIER!!!!!!!", "482": "One night, my wife and i talked about serious priority of our physical wellness aka good health. Silently,I am committed.", "481": ": TOUCHDOWN BELL!!! Steelers lead -0!!!", "480": ": KEEP IT GOING STEELERS d", "472": "we low key snatched some weight this year. I'm so excited for our season", "473": "9", "470": "", "471": ": By any means the lion 🦁 has to get his pounds of meat.", "476": "with /2 min to play in st half, Jags held to only st downs (save some for the nd half defense)", "477": "Pass to Allen for another st down.", "474": "", "475": "are looking hot this year with that fresh new line up!", "478": ":", "479": "I hear boos in Baltimore for the Rat Birds.. and it's GLORIOUS!"}