{"216": ": The Dolphins first drive chewed up over minutes of clock only for it to end in an endzone interception.", "217": ": Let The Show Begin. in LONDON! (9:30am ET on )", "214": ": That's how you end a game, ! | |", "215": ": SAINTS SACK: makes it sacks on the day! | |", "212": ": . with the on rd-and-inches! | |", "213": ":", "210": "Obama did NO CHANGE for black people for years. Trump will by nd year in office Rams…", "211": ": HALFTIME: -nil. : |", "165": "Humerus Medical Nurse Doctor FUNNY Tshirt", "264": "Uhh, has nothing to do w/ how hard playing surface is. That's not a tackle. Not even trying to use his arms.…", "265": ": Treated myself to an early birthday present on way out of today …", "218": "Final •Brees: -41, Yds. TD. •Ingram: Car. Yds. •Thomas: Rec. Yds. TD.", "219": "I noticed that too when I was watching the game. Hands on his hips! What a fool.", "133": "win... !!! 1", "132": "Field goal good!", "131": ": Final.", "130": ": Saints Win!!! |", "137": "My boiiz with tha W", "136": "Wembley was buzzing for some NFL action today!", "135": ": : ⏰: :30 AM ET : : FOX : &amp; : : Official Mia…", "134": "Die letzten Spiele der erbärmlich. Last second Punkte gegen die und zu Null gegen die", "139": ": IT’S GOOD: puts points on the board. | u", "138": "Not that the media noticed, but I took a knee during the National anthem at the game yesterday.", "166": "Godchaux was called for holding on this play, which allowed the Saints to continue their drive for a TD. NO is…", "24": ": There's an American Football game playing at Wembley.", "25": ": Paul Warfield (in ) showing us what the Miami are supposed to look like.", "26": "Ummm Ouch.", "27": "Liberals comfy at home watching NFL While Puerto Rico Mayor says HELP …", "20": ": Saints have one of the worst defenses in the NFL, and couldn't put up ONE point on them. Damn.", "21": "Who Dat!", "22": ": -2 ️We're️back️baby!!!️", "23": ": fire asap and plz sign kap we need mobility at qb..o line can't protect a pocket passer", "160": "We were talking yesterday saying that the UK game yesterday was the one we were planning to se…", "28": ": Not that the media noticed, but I took a knee during the National anthem at the game yesterday.", "29": "Jay Cutler ...", "161": "Cutler is making it look like we lost a world class QB in Tannehill", "4": ": FINAL: Shutout at Wembley. : | |", "8": ": Saints kneeling in unison before singing of the national anthem at Wembley Stadium.", "163": "Greetings , da würden wir wohl verarscht", "119": ": Did Adrian Peterson even play today for the Saints? They need to just trade him to the Giants for a pick and move on.", "258": "What is Jay Cutler doing at the bottom of the screen during ? Stay tuned for my other questionable decision…", "120": "wird ein Shootout! wird total öde! wird ein Shootout! Nö, nö, und nö. Diese Liga", "121": "1 BBS Tshirt Unisex T-Shirt", "122": "Take me back plz …", "123": ": A live look at people watching the game. 1", "124": "EVERYDAY i watch this Trump speech and NO longer support Hillary", "125": "Non ad. Truth without advertising. I love you both periscope …", "126": ": If this kneeling controversy doesn't kill the NFL, this game might. Possibly worst game ever in sports history.", "127": ": ロンドンゲーム 大盛況でした セインツ🆚ドルフィンズ 1UU", "128": ": . with the sack on Drew Brees.", "129": "Very VERY HAPPPY my won today over another team Ive hates forever!! The so yeah !!", "269": "Keep Calm - Tshirt Unisex T-Shirt", "268": ": SAINTS SACK: gets his hands on the QB! | D", "167": ": ️⃣ points. ️⃣ interception. |", "118": ": That was a Brees! takes the shovel pass to the .", "59": ": Rookie RB finishes the st quarter leading the Saints in rushing and receiving yardage. | h…", "58": "The Dolphins scored last week at the Jets, get shut out today against New Orleans who was st in total defense. 🤤", "55": ": nd Quarter. Lets giveaway these for the second batch! RT/FOLLOW…", "54": "is now trending in Canada", "57": "FINAL Quarter. Lets giveaway these for the last batch! RT…", "56": "Great day yesterday at Wembley watching , met some great fans! c", "51": ": END OF RD: hold the lead through the rd. | |", "50": "What happens is the game is nothing but penalties like the game today between ? lol", "53": ": If you walked around Wembley Stadium today you had more rushing yards than Adrian Peterson.", "52": ": is the real reason NFL ratings are down. Blame the Dolphins, not Kap.", "259": ": When will they protest all of the cops that African Americans have assassinated in the last years?", "164": "c", "201": ": A list of things better than the game: ) Stepping on Lego ) Brussels Sprouts ) Dental surgery without anaesthet…", "199": ": Watch ' postgame press conference after . :", "179": "Jaromir Jagr Giants", "200": ": Did that Saints defense really just post a shutout?!", "195": ": Less than minutes away. c0", "194": "EVERYDAY, i watch this Trump speech and NO longer support Hillary", "197": ": ️ road games. ️ W's. | |", "178": "Did that Saints defense really just post a shutout?!", "191": ": Adrian Peterson running this season like..", "190": ": The second half has kicked off from ! Saints with the ball on the NO . | |", "193": "Free Adrian Peterson he too good to just get touches smh", "192": "Gegen die Saints!!! Eine der schlechtesten Defense der Liga", "115": "Boy am I glad I didn't bother to watch that game this morning. Yikes.", "114": "half of hillary supporters didnt read her NEW BOOK...fake supporters …", "88": "日本にも来ないかな〜。RT : ロンドンゲーム 大盛況でした セインツ🆚ドルフィンズ", "89": "Obama did NO CHANGE for black people in years. Trump will by nd year in office Rams", "111": ": wird ein Shootout! wird total öde! wird ein Shootout! Nö, nö, und nö. Diese Liga …", "110": "Miami-- please stop trying. The game is over. You lost badly. Why risk injuries in a game you have 0% chance of winning?", "113": ": This.", "112": "Your O.C should be fired immediately if you allow the Saints defense to shut you out.. embarrassing", "82": ": “Who is: Jay Cutler?” 8", "83": ": Watch 's postgame press conference after . :", "80": "ロンドンゲーム 大盛況でした セインツ🆚ドルフィンズ 1UU", "81": "भारत को स्वच्छभारत की महती आवश्यकता है चाहे कचरे से हो या अज्ञान से। …", "86": "In honor of Marshon Lattimores great game, get his Wood Burned art piece for ONLY $35 SHIPPED! originally $50!…", "87": "Just seemed Jay Cutler wasn't into his role in the Dolphins wildcat formation.", "84": "Miami Dolphins' fans current mood...", "85": "Liberals comfy at home watching NFL -While Puerto Rico Mayor says HELP …", "251": ": Die NFL ist zurück in London! C", "198": ":", "256": "Got to have been the worst game I’ve ever seen", "206": ": London feiert den Statistikgott /2", "226": ": I'd rather lick red hot charcoal than listen to Charles Davis on commentary.", "257": ": Cutler giving the NFL another go", "3": "Final | , |", "177": "I'm trying to get use to the Twitter thing!!!", "254": ": ¡Los sucumben ante la ofensiva de ! ¡Imponente blanqueada!", "7": "Ironic tshirt Alanis Morisette Unisex T-Shirt u", "247": "nd Quarter. Lets giveaway these for the second batch! RT… c", "255": "shutout the in London!", "225": ": Another brutal football game sent to London", "245": ": After a -0 first half in London fans will now refer to American football as \"soccer.\"", "244": ": Someone get Oprah off the field d", "108": "nd Quarter. Lets giveaway these for the third batch! RT/…", "109": ": Jay Cutler is not human, and today he proves we are all in a videogame", "241": ": carries for yards. It wouldn't surprise me if Adrian Peterson refuses to leave London until he gets traded", "240": "Vintage Elephant TShirt iPhone Cases", "243": "That's what a shutdown corner looks like.", "242": ": This game has done more to ruin relations with England than the Revolutionary War.", "102": "Croc PS1 Tshirt! Unisex T-Shirt 0", "103": ": It's time to and . Every fan who suffered through today's debacle needs to make t…", "100": "When you wake up early to watch the game and realize it's been blocked out again for the nd week in a row.…", "101": "In all the crazy news of today I forgot to say how HAPPY I am that my won huge earlier!!", "106": ": SAINTS SACK: with the take down on rd-and-long! |", "107": ": BREES TOSSES TDs, SAINTS SHUT OUT DOLPHINS http…", "104": ": When you realize you have to put your cigarette out and go play offense again.", "105": ": A trio of Miami Dolphins players were kneeling during the national anthem this morning. dD", "39": ": It’s finally over…Saints cruise to a -0 victory over the Dolphins", "38": ": O (2-2) venceu com facilidade o (1-2) em Londres, no estádio de Wembley. …", "33": ": Every time Jay Cutler throws an interception a penguin is born.", "32": "Adam Gase and Jay Cutler, the Dynamic Duo, got shutout by the Saints' defense. THE SAINTS.", "31": "seniors supporting XC seniors at McQuaid XC Invitational! …", "30": ": What is going through this guy's mind right now?", "37": ": Remember when fans were excited for Jay Cutler as their QB and said they'd win the East? h…", "36": ": FINAL Quarter. Lets giveaway these for the last batch! RT/FOLLOW…", "35": "$195-Nike Air Jordan Retro Lakers men's size . -", "34": ": Another -and-out for the Saints defense courtesy of ! | |", "246": "Cow tee Jay Cutler", "252": "Week : Man, can't get any worse than losing to the -2 &amp; scoring pts Week : Hold my beer", "205": "| did it again!", "223": ": The New Orleans Saints game ball today goes to running back Alvin Kamara |", "176": ": &gt;&gt;; Live O.J. Simpson Si Newho…", "60": "1 Texas Home T-shirt J 1", "61": ": rd-and-long? Not a problem for . | |", "62": "Shutout!! It is a season long winning streak!! Two in a row!!", "63": ": st Quarter. Lets giveaway these for the first batch! RT/FOLLOW …", "64": "️ road games. ️ W's. | |", "65": ": Que momento! encontrou seu herói da infância, , antes do início do jogo. …", "66": "EVERYDAY i see this Trump speech and NO longer support Hillary", "67": "00 the Green Fairy Tshirt Unisex T-Shirt U", "68": "Final", "69": "Great day yesterday at Wembley watching , met some great fans!", "175": ": Dolphins vs Saints week highlights", "174": ": First-half recap 1", "173": ": Saints convert on th down on a keeper! | |", "172": ": host knows the topics, host doesn’t, &amp; random guest is unprepared.. Jay Cutler, , Subscribe https:…", "171": ": It's a beautiful day outside and I could care less what's going on in London! 2", "170": ": Watch d O.J. Simpsonِ ِ ِ ِ ِ ِ", "203": "The latest The Seahawk Femme Daily! 1 Thanks to", "222": ": ️ meets is excited for ! Head over to our Instagram story for more behind the scenes shots", "181": "Mandela as Tshirt Women's T-Shirt", "253": ": GAMEDAY!!", "248": ": Scenes from the first half at . | -0", "182": "Lil Monkey First Birthday Tshirt Personalized", "183": "| Termina el partido.", "180": "Just married tee shirt with wedding date stamp", "2": ":", "162": "Retweeted NFL Canada (): That was a Brees! takes the shovel pass to the . ...", "187": ": Brees to for . | |", "184": ": These so call \"I dont like no more\" people looking like..", "6": ": Does anyone know the name of the rd down sound/jingle the Miami Dolphins use in the NFL?", "220": ": Do you think the NFL should keep playing games in London?", "186": ": time lapse taking the field -", "188": "(esp Defense) should be pissed! Cutler is exactly what we all thought he is...worthless at QB.", "189": ": Zero Fox Given Baby Bodysuit https://…", "202": "What a way to start Week with a Saints victory!", "196": "Tons of jerseys being added to firepits today.", "221": "careth not.", "185": ": For those wondering: dolphins and saints kneeled during the National Anthem.", "99": ": Good Morning!!! It's in London! The Saints battle the Dolphins at :30 am CT on FOX! …", "98": ": END OF ST: Scoreless in London after . |", "168": "Magic Card Funny T Shirt Unisex T-Shirt", "169": "nd straight win. lost last games in London.", "229": ", being launched this afternoon by Tom 'TurnMyMikeOn' Daley , before…", "228": ": SAINTS TAKEAWAY: picks off Cutler in the Dolphins end zone! |", "91": "And down goes Cutler!", "90": ": in London :10", "93": "A recap of Jay Cutler's day ...", "92": "Highlights!", "95": ": The highlights of this game so far...", "94": "on the computer …", "97": ": ALL LIVES MATTER in AMERICA Stand and UNITE for SOLUTIONS and PEACE️🇺🇸️ https:…", "96": "Baseball Tshirt Style \"I can't...I have dance.\"", "11": "d Runescape Strength Tshirt Unisex T-Shirt", "10": ": The announcers just called the Saints defense “swarming and ball hawking” holy shit the Dolphins stink", "13": "Zero Fox Given Baby Bodysuit", "12": "i bet you AP is pissed he's not getting pt when all there doing is running!", "15": "Vintage Elephant TShirt Unisex T-Shirt", "14": "Thank God I didn’t give up Julio Jones for Jay Ajayi", "17": "Hale pack (tshirt) Unisex T-Shirt u0", "16": ": IT'S GOOD: adds to the lead. | |", "19": "", "18": "Go Check Out My new video", "117": ": The Miami Dolphins are the first team in NFL history to be shutout in London.", "250": "Ginger Beard Man Ugly Tees Unisex T-Shirt", "116": "Theneedledrop Tshirt Unisex T-Shirt", "204": ": TRUTH! lol", "151": ": Keine Diskussion was heute geguckt wird! Läuft bereits: …", "150": "Treated myself to an early birthday present on way out of today …", "153": "A list of things better than the game: ) Stepping on Lego ) Brussels Sprouts ) Dental surgery without…", "152": "Final | , |", "155": "Jay Cutler, you came out of retirement for this?", "154": ": We've kicked off in London! Saints defense to take the field first. |", "157": "Unrequited Love TShirt Women's T-Shirt D", "156": ": with my brilliant - supporting our and in london!", "159": ":", "158": ": A. In my infinite wisdom, I don't agree. B. You know how DIFFICULT it is to be \"way worse\" than points? https…", "234": "The Dolphins didn't get the W at Wembley but - on his first overseas trip - appreciates chance to show …", "238": "Secular Humanist by Tai's Tees Unisex T-Shirt", "239": "Houston, I Have So Many Problems Men's Shirt", "207": ": This pretty much sums up the ' performance this morning against the .", "235": ": SAINTS TOUCHDOWN: hits for the first TD of the day. | |", "236": "Papelón de en Wembley. Todo mal.", "237": ": Mike Glennon, \"I'm the worst starting QB today!\" Jay Cutler, \"Hold my cigarette!\"", "230": ": Just seemed Jay Cutler wasn't into his role in the Dolphins wildcat formation.", "231": ": Brees completes to Kamara for the TD. | -0", "232": ": . is about to kick off at – and so is our amazing partnership! We’re pumped! https…", "233": "Vintage Summer - Tshirt Unisex T-Shirt", "224": ": nd Quarter. Lets giveaway these for the third batch! RT/FOLLOW …", "48": "Would be making yard plays at -0 down in the th? . Sadly lacklustre . First was great.", "49": "Jay Cutler passed Troy Aikman and Y.A. Tittle for th all-time in passing yards.", "46": "Back to back shutouts on the offense is not good. I need answers for my Dolphins problem.", "47": "Jay Cutler passed Jim Everett for th all-time in pass completions.", "44": "Another sack for the defense", "45": ": Watch my NEW NUDE video TODAY at", "42": "Our next episode of will be our episode. We will look back at and", "43": "", "40": "Lover of SA Beer Unisex T-Shirt", "41": "Meanwhile in NFL ,500 watch it's nearly like being at High count in 's", "1": "Congratulations and on the Win!", "5": ": We have reached the half.", "9": "", "146": ": If you went to the bathroom in the first half, you have more rushing yards than Adrian Peterson.", "147": ": Every member of the New Orleans is taking a knee ahead of the National Anthem", "144": ": Besser drauf als Cutler https…", "145": "Alien Tie Dye T-shirt", "142": "Final.", "143": "The defense just shut a team out", "140": "Dolphins got pounded in London by The Saints. Who Dat Nation:", "141": ": Ready. To. Go. is back home.", "209": ": SAINTS TOUCHDOWN: and team up for the score. | |", "208": "Does anyone know the name of the rd down sound/jingle the Miami Dolphins use in the NFL?", "148": ": Feed | |", "149": ": Congratulations and on the Win!", "77": "Tuts+ Tees Unisex T-Shirt", "76": "\"Great Minds Dink Alike\" Pickleball T-Shirt", "75": "Nachdem ich jetzt mal genauer hingeschaut habe...das ist ja schon im letzten Quarter.", "74": "New Orleans VS Miami Game Recap", "73": "wished you would have signed with any other team.", "72": ": If the Dolphins do not erect a Jay Cutler statue in this pose it's a tragedy.", "71": "SPANKED THAT booty down in", "70": "Can't belive it. Watched my boys live in a stadium for first time and they won!", "79": "Ed Hochuli was the man of the match. Too many penalties....", "78": "ALL LIVES MATTER in AMERICA Stand and UNITE for SOLUTIONS and PEACE️… 18d", "263": "Tshirt The Snake iPhone Cases 10", "249": "Unrequited Love TShirt Women's T-Shirt", "262": ": Touchdown Saints. Brees finds Thomas for the TD. | -0", "227": ": Rookie dazzled the Dolphins to earn Player of the Game in today's victory! | | ht…", "261": ": That moment when met .", "260": "seconds to go... just enough time for Cutler to get sacked again. for bringing Cutler in.", "267": "I seriously think I get dumber each time I listen to the announcers of any game - Caveman speak overload", "266": "Awesome win for my (2-2) today in London. Let’s keep the momentum going!"}