{"24": "Just posted a video", "25": "I really missed this a lot on this year's Republic day parade but the shoes were duly filled by the NSG Commandos.", "26": "No words can do this tribute to an outstanding soldier", "27": "Just posted a photo", "20": "Attack on besan ka laddoo", "21": "st store of SEVEN opens at my hometown RANCHI. So much love and affection from the people had…", "22": "Just posted a photo", "23": "Just posted a video", "28": ": Statement by DGMO on Sep", "29": "Just posted a photo", "0": "Great weather and Pubg.This headset feels so comfortable, I could wear it all day. Check out .in's Voice… c2", "4": "Just for fun, plz try it at home.", "8": "Morning walk with the pack.i think Sam knows she…", "59": "As v have this debate on freedom of speech our forces r making sure v stay in position to keep debating.", "58": "Spl forces and commando unit's r normal ppl like u and me who r highly motivated and trained to put the interest of the nation before self", "55": "Good position but not perfect", "54": "Static line starts to work", "57": "A few pics of my st para jump.2nd in line,a bit nervous yeah ofcourse", "56": "First leap off a perfectly working aircraft 1", "51": "Followed by secs of peace,feeling of being a bird and then the chaos of how the landing wd be.", "50": ": Good Shoes take you to good places. Introducing all new Seven's Women's Collection. Get it: d http…", "53": "Parachute coming out of the bag", "52": "Parachute opens up.this is the perfect position I was talking about but then u know it's not his first jump", "88": ": ALO TAMIL NADU! Top of the league after a great team-performance. THANK YOU as always on your incredible support... htt…", "89": "If Rohit doesn't get out he will certainly get today", "82": ": now opens in Meerut our good wishes to Dewesh &amp; Saneha", "83": "Respect to Mr Dalmiya for his contribution in Cricket.May his soul Rest in Peace.Strength and warmth to his loved ones !", "80": "How many of u agree this was of the most exciting stroke single cylinder bikes to ride,need to restore mine quickly", "81": "Decade long ride with no speed bumps,just full of thrill &amp; energy.4m Star City New Gold Edition.journey continues.. 1", "86": "Stadium debut for ZIVA, her first time into the dressing room", "87": "Finally the wait is over but another couple of months before I can take her on her first ride.guess…", "84": "SPORTSFIT now open at ILD Sohna road", "85": "", "3": "With waterfalls around Ranchi, v cd do this whenever v wanted but now to do something like this after more than … D", "7": "Very excited to bring you guys a special treat on my birthday! Take part in the of new…", "39": "Just got served this during breakfast.thanks guys", "38": "Cngrts to IAF on their latest warbirds and every1 who were part of the project indeed a very proud moment for INDIA", "33": "Team SPORTSFIT Lucknow.Nice to visit our first franchise.an hr of gym and fun with the members and management 0", "32": "As I walked the path, the journey became my life. Here's a glimpse of it.", "31": ": Update Uri Ops. Total five terrorists killed. Two soldiers injured; evacuated and stable. Op continues.", "30": "Great comeback by Sakshi Malik win our st medal in Rio.determination and self belief r the key for a performance like this.congratulation", "37": "Thanks to all for ur lovely birthday wishes,it really means a lot.with god's blessing I could celebrate my birthday along with EID.", "36": "What could be the best way to celebrate my birthday,planted the st and very spl tree at the farm house KAILASHPATI 1", "35": "Saw a full mch of boxing after yrs.thks for mkg INDIA proud,it's just the start ur hrd wrk,dedication and sacrifice paid off", "34": "Long travel day ahead u", "60": "My shirt number is now my footwear brand. Launching SEVEN. RT", "61": "Off from Vizag,one of the city that I would love to live in,nice and beautiful landscape with beach and home to my first big inning", "62": "The world changes one day at a time.What can happen in seven? RT", "63": ": It is the fans' turn to do their to help &amp; the Indian team win the . What's your ? ht…", "64": "Congrats and all the support staff.dedication and hard work paid off", "65": "A well deserved final game in ISL.fantastic skill by both the teams.congrats to Chennaiyin fans and team,well done boys", "66": "Was wearing Baljit's t shirt.at breakfast he said paaji u will score day bcs of the tshirt.i must say he was right", "67": "Had to give it back and being at least kg heavier than him helped", "68": "The man who had the task of marking me,started well and then kept pushing me for the whole practice session", "69": "Pic from today's practice,it was so much fun.Fikru was my partner.thanks to the team for letting me play", "2": "Very smart", "6": "Just posted a video", "99": "Congrats to Balwant singh for becoming the st Indian to score in ISL.", "98": "Thks to Vita Dani and Abhishek for being there with the team and Abhishek has to report for morrow's practice to pick up his penalty skills", "91": "Abhishek is just outstanding,so much energy and knowledge he has.was really nice to c the game with him.i have to say he is our no1 fan", "90": "Very well batted Rohit.thats Rohit for everyone,sheer talent.Enjoy and Witness the class in action.", "93": "Will be there to watch second home game of chennaiyin FC.Finally will be in front of Chennai fans.Vanga vandhu parunga.", "92": "A very well played game.team came back strong after the defeat and chennai fans didn't disappoint us,full house as eected.Thanks", "95": "Had no clue I make crackers also,hope it's good.happy Diwali", "94": "Saw ManUtd play after long,fantastic game last min equaliser.saw three football matches in one day,time to hit the bed.early start morrow", "97": "Balwant will consider that as a missed chance but good start to the game", "96": "Wish you all a very happy Diwali.feels good to be home.my dog is running all over the house atleast she is not shivering like other dogs", "11": "Dances better than the father atleast", "10": "Ziva gives me company for the last walk to the…", "13": "When Ziva wanted to give a hug to papa during the match", "12": "Game over, had a nice sleep now back to Daddy’s duties", "15": "An honour to get the Padma Bhushan and receiving it in Uniform increases the excitement ten…", "14": "Shooting gun is much more fun than shooting ads D", "17": "Still some time for the tournament to start but as eected a brilliant campaign to kick it off … 20", "16": "Fun time with the family", "19": "ZOYA(Dutch shepherd) does some training and LILY(husky) does the cheering job", "18": "Just posted a photo", "48": "Teaser: Gulf's always been abt things I luv.Bikes,crkt &amp; now..soccer.Happy2share super news soon! Stay tuned.", "49": ": We train to Win", "46": ": For his indomitable Courage, Sacrifice &amp; Bravery he was awarded the posthumously. 0", "47": "Super happy to say Gulf unites me with my first love.Happy welcome my fav club to the family!", "44": "thank you sir", "45": "Nothing to add", "42": "Wish u a very happy birthday Anant.u gave the best gift to urself by losing over kg.discipline and determination", "43": "Happy Holi to all d1", "40": ": .S Dhoni with his team at reception at India House,Harare. About community members attended the reception https:…", "41": "Proud to be associated with Lava,a truly reliable Indian brand.Pic clicked on my Lava phone.", "1": "A bit of hugging,training, catching practice and getting unconditional love in return.priceless", "5": "This is what happens when u keeping bossing around for the whole year and finally youngsters get a chance to give i…", "9": "Thanks everyone for the support and Mumbai for…", "77": "Well done ZAK on a fantastic career.without U it wd hve been very difficult to achieve what the ICT did.most clever fast bowler I know", "76": "Life has just started now,U still can and definitely will contribute a lot to Indian Cricket.wish U all the success", "75": "Didn't see Viv Richards bat in person but I can proudly say I have witnessed Virender Sehwag tearing apart the best bowling attacks", "74": "Talent in batting is one thing but to have the mindset of Virupa in batting is as close to impossible as it can get.v keep saying b positive", "73": "Look for a single but he was one person who was always looking for a boundary.many will try to play like u but my advice wd b to enjoy ur", "72": "Batting and be themselves.congrats on a fantastic career", "71": "BOOST winners in an event in CHENNAI", "70": "", "79": "it's a big problem so if u have any spare parts do let me know,need to restore two of mine", "78": "ur right this one is better mate"}
